NordicPlayground/nrf528xx-ble-throughput-demo/display_shield_files/inc/drv_sx1509_bitfields.h
/* Copyright (c) 2015 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is property of Nordic Semiconductor ASA.
 * Terms and conditions of usage are described in detail in NORDIC
 * SEMICONDUCTOR STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 * Licensees are granted free, non-transferable use of the information. NO
 * WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 * the file.
 *
 */
#ifndef DRV_SX1509_BITFIELDS_H__
#define DRV_SX1509_BITFIELDS_H__


/* Register: INPBUFDISABLE. */
/* Description: Input buffer disable register. */


/* Field INPBUF15: Disables/Enables the input buffer of the I/O pin. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF15_Pos      (15)                                           /*!< The position of the field. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF15_Msk      (0x1 << DRV_SX1509_INPBUFDISABLE_INPBUF15_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF15_Disabled (0)                                            /*!< Input buffer is disabled (input actually not being used, LED connection). */
#define DRV_SX1509_INPBUFDISABLE_INPBUF15_Enabled  (1)                                            /*!< Input buffer is enabled (input actually being used). */


/* Field INPBUF14: Disables/Enables the input buffer of the I/O pin. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF14_Pos      (14)                                           /*!< The position of the field. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF14_Msk      (0x1 << DRV_SX1509_INPBUFDISABLE_INPBUF14_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF14_Disabled (0)                                            /*!< Input buffer is disabled (input actually not being used, LED connection). */
#define DRV_SX1509_INPBUFDISABLE_INPBUF14_Enabled  (1)                                            /*!< Input buffer is enabled (input actually being used). */


/* Field INPBUF13: Disables/Enables the input buffer of the I/O pin. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF13_Pos      (13)                                           /*!< The position of the field. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF13_Msk      (0x1 << DRV_SX1509_INPBUFDISABLE_INPBUF13_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF13_Disabled (0)                                            /*!< Input buffer is disabled (input actually not being used, LED connection). */
#define DRV_SX1509_INPBUFDISABLE_INPBUF13_Enabled  (1)                                            /*!< Input buffer is enabled (input actually being used). */


/* Field INPBUF12: Disables/Enables the input buffer of the I/O pin. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF12_Pos      (12)                                           /*!< The position of the field. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF12_Msk      (0x1 << DRV_SX1509_INPBUFDISABLE_INPBUF12_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF12_Disabled (0)                                            /*!< Input buffer is disabled (input actually not being used, LED connection). */
#define DRV_SX1509_INPBUFDISABLE_INPBUF12_Enabled  (1)                                            /*!< Input buffer is enabled (input actually being used). */


/* Field INPBUF11: Disables/Enables the input buffer of the I/O pin. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF11_Pos      (11)                                           /*!< The position of the field. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF11_Msk      (0x1 << DRV_SX1509_INPBUFDISABLE_INPBUF11_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF11_Disabled (0)                                            /*!< Input buffer is disabled (input actually not being used, LED connection). */
#define DRV_SX1509_INPBUFDISABLE_INPBUF11_Enabled  (1)                                            /*!< Input buffer is enabled (input actually being used). */


/* Field INPBUF10: Disables/Enables the input buffer of the I/O pin. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF10_Pos      (10)                                           /*!< The position of the field. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF10_Msk      (0x1 << DRV_SX1509_INPBUFDISABLE_INPBUF10_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF10_Disabled (0)                                            /*!< Input buffer is disabled (input actually not being used, LED connection). */
#define DRV_SX1509_INPBUFDISABLE_INPBUF10_Enabled  (1)                                            /*!< Input buffer is enabled (input actually being used). */


/* Field INPBUF9: Disables/Enables the input buffer of the I/O pin. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF9_Pos      (9)                                           /*!< The position of the field. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF9_Msk      (0x1 << DRV_SX1509_INPBUFDISABLE_INPBUF9_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF9_Disabled (0)                                           /*!< Input buffer is disabled (input actually not being used, LED connection). */
#define DRV_SX1509_INPBUFDISABLE_INPBUF9_Enabled  (1)                                           /*!< Input buffer is enabled (input actually being used). */


/* Field INPBUF8: Disables/Enables the input buffer of the I/O pin. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF8_Pos      (8)                                           /*!< The position of the field. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF8_Msk      (0x1 << DRV_SX1509_INPBUFDISABLE_INPBUF8_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF8_Disabled (0)                                           /*!< Input buffer is disabled (input actually not being used, LED connection). */
#define DRV_SX1509_INPBUFDISABLE_INPBUF8_Enabled  (1)                                           /*!< Input buffer is enabled (input actually being used). */


/* Field INPBUF7: Disables/Enables the input buffer of the I/O pin. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF7_Pos      (7)                                           /*!< The position of the field. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF7_Msk      (0x1 << DRV_SX1509_INPBUFDISABLE_INPBUF7_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF7_Disabled (0)                                           /*!< Input buffer is disabled (input actually not being used, LED connection). */
#define DRV_SX1509_INPBUFDISABLE_INPBUF7_Enabled  (1)                                           /*!< Input buffer is enabled (input actually being used). */


/* Field INPBUF6: Disables/Enables the input buffer of the I/O pin. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF6_Pos      (6)                                           /*!< The position of the field. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF6_Msk      (0x1 << DRV_SX1509_INPBUFDISABLE_INPBUF6_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF6_Disabled (0)                                           /*!< Input buffer is disabled (input actually not being used, LED connection). */
#define DRV_SX1509_INPBUFDISABLE_INPBUF6_Enabled  (1)                                           /*!< Input buffer is enabled (input actually being used). */


/* Field INPBUF5: Disables/Enables the input buffer of the I/O pin. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF5_Pos      (5)                                           /*!< The position of the field. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF5_Msk      (0x1 << DRV_SX1509_INPBUFDISABLE_INPBUF5_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF5_Disabled (0)                                           /*!< Input buffer is disabled (input actually not being used, LED connection). */
#define DRV_SX1509_INPBUFDISABLE_INPBUF5_Enabled  (1)                                           /*!< Input buffer is enabled (input actually being used). */


/* Field INPBUF4: Disables/Enables the input buffer of the I/O pin. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF4_Pos      (4)                                           /*!< The position of the field. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF4_Msk      (0x1 << DRV_SX1509_INPBUFDISABLE_INPBUF4_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF4_Disabled (0)                                           /*!< Input buffer is disabled (input actually not being used, LED connection). */
#define DRV_SX1509_INPBUFDISABLE_INPBUF4_Enabled  (1)                                           /*!< Input buffer is enabled (input actually being used). */


/* Field INPBUF3: Disables/Enables the input buffer of the I/O pin. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF3_Pos      (3)                                           /*!< The position of the field. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF3_Msk      (0x1 << DRV_SX1509_INPBUFDISABLE_INPBUF3_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF3_Disabled (0)                                           /*!< Input buffer is disabled (input actually not being used, LED connection). */
#define DRV_SX1509_INPBUFDISABLE_INPBUF3_Enabled  (1)                                           /*!< Input buffer is enabled (input actually being used). */


/* Field INPBUF2: Disables/Enables the input buffer of the I/O pin. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF2_Pos      (2)                                           /*!< The position of the field. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF2_Msk      (0x1 << DRV_SX1509_INPBUFDISABLE_INPBUF2_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF2_Disabled (0)                                           /*!< Input buffer is disabled (input actually not being used, LED connection). */
#define DRV_SX1509_INPBUFDISABLE_INPBUF2_Enabled  (1)                                           /*!< Input buffer is enabled (input actually being used). */


/* Field INPBUF1: Disables/Enables the input buffer of the I/O pin. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF1_Pos      (1)                                           /*!< The position of the field. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF1_Msk      (0x1 << DRV_SX1509_INPBUFDISABLE_INPBUF1_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF1_Disabled (0)                                           /*!< Input buffer is disabled (input actually not being used, LED connection). */
#define DRV_SX1509_INPBUFDISABLE_INPBUF1_Enabled  (1)                                           /*!< Input buffer is enabled (input actually being used). */


/* Field INPBUF0: Disables/Enables the input buffer of the I/O pin. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF0_Pos      (0)                                           /*!< The position of the field. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF0_Msk      (0x1 << DRV_SX1509_INPBUFDISABLE_INPBUF0_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INPBUFDISABLE_INPBUF0_Disabled (0)                                           /*!< Input buffer is disabled (input actually not being used, LED connection). */
#define DRV_SX1509_INPBUFDISABLE_INPBUF0_Enabled  (1)                                           /*!< Input buffer is enabled (input actually being used). */


/* Register: LONGSLEWRATE. */
/* Description: Output buffer long slew register. */


/* Field PIN15: Enables/Disables increased slew rate of the output buffer of each [output-configured] IO. */
#define DRV_SX1509_LONGSLEWRATE_PIN15_Pos      (15)                                       /*!< The position of the field. */
#define DRV_SX1509_LONGSLEWRATE_PIN15_Msk      (0x1 << DRV_SX1509_LONGSLEWRATE_PIN15_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LONGSLEWRATE_PIN15_Disabled (0)                                        /*!< Increased slew rate is disabled. */
#define DRV_SX1509_LONGSLEWRATE_PIN15_Enabled  (1)                                        /*!< Increased slew rate is enabled. */


/* Field PIN14: Enables/Disables increased slew rate of the output buffer of each [output-configured] IO. */
#define DRV_SX1509_LONGSLEWRATE_PIN14_Pos      (14)                                       /*!< The position of the field. */
#define DRV_SX1509_LONGSLEWRATE_PIN14_Msk      (0x1 << DRV_SX1509_LONGSLEWRATE_PIN14_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LONGSLEWRATE_PIN14_Disabled (0)                                        /*!< Increased slew rate is disabled. */
#define DRV_SX1509_LONGSLEWRATE_PIN14_Enabled  (1)                                        /*!< Increased slew rate is enabled. */


/* Field PIN13: Enables/Disables increased slew rate of the output buffer of each [output-configured] IO. */
#define DRV_SX1509_LONGSLEWRATE_PIN13_Pos      (13)                                       /*!< The position of the field. */
#define DRV_SX1509_LONGSLEWRATE_PIN13_Msk      (0x1 << DRV_SX1509_LONGSLEWRATE_PIN13_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LONGSLEWRATE_PIN13_Disabled (0)                                        /*!< Increased slew rate is disabled. */
#define DRV_SX1509_LONGSLEWRATE_PIN13_Enabled  (1)                                        /*!< Increased slew rate is enabled. */


/* Field PIN12: Enables/Disables increased slew rate of the output buffer of each [output-configured] IO. */
#define DRV_SX1509_LONGSLEWRATE_PIN12_Pos      (12)                                       /*!< The position of the field. */
#define DRV_SX1509_LONGSLEWRATE_PIN12_Msk      (0x1 << DRV_SX1509_LONGSLEWRATE_PIN12_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LONGSLEWRATE_PIN12_Disabled (0)                                        /*!< Increased slew rate is disabled. */
#define DRV_SX1509_LONGSLEWRATE_PIN12_Enabled  (1)                                        /*!< Increased slew rate is enabled. */


/* Field PIN11: Enables/Disables increased slew rate of the output buffer of each [output-configured] IO. */
#define DRV_SX1509_LONGSLEWRATE_PIN11_Pos      (11)                                       /*!< The position of the field. */
#define DRV_SX1509_LONGSLEWRATE_PIN11_Msk      (0x1 << DRV_SX1509_LONGSLEWRATE_PIN11_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LONGSLEWRATE_PIN11_Disabled (0)                                        /*!< Increased slew rate is disabled. */
#define DRV_SX1509_LONGSLEWRATE_PIN11_Enabled  (1)                                        /*!< Increased slew rate is enabled. */


/* Field PIN10: Enables/Disables increased slew rate of the output buffer of each [output-configured] IO. */
#define DRV_SX1509_LONGSLEWRATE_PIN10_Pos      (10)                                       /*!< The position of the field. */
#define DRV_SX1509_LONGSLEWRATE_PIN10_Msk      (0x1 << DRV_SX1509_LONGSLEWRATE_PIN10_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LONGSLEWRATE_PIN10_Disabled (0)                                        /*!< Increased slew rate is disabled. */
#define DRV_SX1509_LONGSLEWRATE_PIN10_Enabled  (1)                                        /*!< Increased slew rate is enabled. */


/* Field PIN9: Enables/Disables increased slew rate of the output buffer of each [output-configured] IO. */
#define DRV_SX1509_LONGSLEWRATE_PIN9_Pos      (9)                                       /*!< The position of the field. */
#define DRV_SX1509_LONGSLEWRATE_PIN9_Msk      (0x1 << DRV_SX1509_LONGSLEWRATE_PIN9_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LONGSLEWRATE_PIN9_Disabled (0)                                       /*!< Increased slew rate is disabled. */
#define DRV_SX1509_LONGSLEWRATE_PIN9_Enabled  (1)                                       /*!< Increased slew rate is enabled. */


/* Field PIN8: Enables/Disables increased slew rate of the output buffer of each [output-configured] IO. */
#define DRV_SX1509_LONGSLEWRATE_PIN8_Pos      (8)                                       /*!< The position of the field. */
#define DRV_SX1509_LONGSLEWRATE_PIN8_Msk      (0x1 << DRV_SX1509_LONGSLEWRATE_PIN8_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LONGSLEWRATE_PIN8_Disabled (0)                                       /*!< Increased slew rate is disabled. */
#define DRV_SX1509_LONGSLEWRATE_PIN8_Enabled  (1)                                       /*!< Increased slew rate is enabled. */


/* Field PIN7: Enables/Disables increased slew rate of the output buffer of each [output-configured] IO. */
#define DRV_SX1509_LONGSLEWRATE_PIN7_Pos      (7)                                       /*!< The position of the field. */
#define DRV_SX1509_LONGSLEWRATE_PIN7_Msk      (0x1 << DRV_SX1509_LONGSLEWRATE_PIN7_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LONGSLEWRATE_PIN7_Disabled (0)                                       /*!< Increased slew rate is disabled. */
#define DRV_SX1509_LONGSLEWRATE_PIN7_Enabled  (1)                                       /*!< Increased slew rate is enabled. */


/* Field PIN6: Enables/Disables increased slew rate of the output buffer of each [output-configured] IO. */
#define DRV_SX1509_LONGSLEWRATE_PIN6_Pos      (6)                                       /*!< The position of the field. */
#define DRV_SX1509_LONGSLEWRATE_PIN6_Msk      (0x1 << DRV_SX1509_LONGSLEWRATE_PIN6_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LONGSLEWRATE_PIN6_Disabled (0)                                       /*!< Increased slew rate is disabled. */
#define DRV_SX1509_LONGSLEWRATE_PIN6_Enabled  (1)                                       /*!< Increased slew rate is enabled. */


/* Field PIN5: Enables/Disables increased slew rate of the output buffer of each [output-configured] IO. */
#define DRV_SX1509_LONGSLEWRATE_PIN5_Pos      (5)                                       /*!< The position of the field. */
#define DRV_SX1509_LONGSLEWRATE_PIN5_Msk      (0x1 << DRV_SX1509_LONGSLEWRATE_PIN5_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LONGSLEWRATE_PIN5_Disabled (0)                                       /*!< Increased slew rate is disabled. */
#define DRV_SX1509_LONGSLEWRATE_PIN5_Enabled  (1)                                       /*!< Increased slew rate is enabled. */


/* Field PIN4: Enables/Disables increased slew rate of the output buffer of each [output-configured] IO. */
#define DRV_SX1509_LONGSLEWRATE_PIN4_Pos      (4)                                       /*!< The position of the field. */
#define DRV_SX1509_LONGSLEWRATE_PIN4_Msk      (0x1 << DRV_SX1509_LONGSLEWRATE_PIN4_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LONGSLEWRATE_PIN4_Disabled (0)                                       /*!< Increased slew rate is disabled. */
#define DRV_SX1509_LONGSLEWRATE_PIN4_Enabled  (1)                                       /*!< Increased slew rate is enabled. */


