NordicPlayground/nrf528xx-ble-throughput-demo/display_shield_files/inc/drv_sx1509_bitfields.h
/* Field PIN3: Enables/Disables increased slew rate of the output buffer of each [output-configured] IO. */
#define DRV_SX1509_LONGSLEWRATE_PIN3_Pos      (3)                                       /*!< The position of the field. */
#define DRV_SX1509_LONGSLEWRATE_PIN3_Msk      (0x1 << DRV_SX1509_LONGSLEWRATE_PIN3_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LONGSLEWRATE_PIN3_Disabled (0)                                       /*!< Increased slew rate is disabled. */
#define DRV_SX1509_LONGSLEWRATE_PIN3_Enabled  (1)                                       /*!< Increased slew rate is enabled. */


/* Field PIN2: Enables/Disables increased slew rate of the output buffer of each [output-configured] IO. */
#define DRV_SX1509_LONGSLEWRATE_PIN2_Pos      (2)                                       /*!< The position of the field. */
#define DRV_SX1509_LONGSLEWRATE_PIN2_Msk      (0x1 << DRV_SX1509_LONGSLEWRATE_PIN2_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LONGSLEWRATE_PIN2_Disabled (0)                                       /*!< Increased slew rate is disabled. */
#define DRV_SX1509_LONGSLEWRATE_PIN2_Enabled  (1)                                       /*!< Increased slew rate is enabled. */


/* Field PIN1: Enables/Disables increased slew rate of the output buffer of each [output-configured] IO. */
#define DRV_SX1509_LONGSLEWRATE_PIN1_Pos      (1)                                       /*!< The position of the field. */
#define DRV_SX1509_LONGSLEWRATE_PIN1_Msk      (0x1 << DRV_SX1509_LONGSLEWRATE_PIN1_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LONGSLEWRATE_PIN1_Disabled (0)                                       /*!< Increased slew rate is disabled. */
#define DRV_SX1509_LONGSLEWRATE_PIN1_Enabled  (1)                                       /*!< Increased slew rate is enabled. */


/* Field PIN0: Enables/Disables increased slew rate of the output buffer of each [output-configured] IO. */
#define DRV_SX1509_LONGSLEWRATE_PIN0_Pos      (0)                                       /*!< The position of the field. */
#define DRV_SX1509_LONGSLEWRATE_PIN0_Msk      (0x1 << DRV_SX1509_LONGSLEWRATE_PIN0_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LONGSLEWRATE_PIN0_Disabled (0)                                       /*!< Increased slew rate is disabled. */
#define DRV_SX1509_LONGSLEWRATE_PIN0_Enabled  (1)                                       /*!< Increased slew rate is enabled. */


/* Register: LOWDRIVE. */
/* Description: Output buffer low drive register. */


/* Field PIN15: Enables/Disables reduced drive of the output buffer of each [output-configured] IO. */
#define DRV_SX1509_LOWDRIVE_PIN15_Pos      (15)                                   /*!< The position of the field. */
#define DRV_SX1509_LOWDRIVE_PIN15_Msk      (0x1 << DRV_SX1509_LOWDRIVE_PIN15_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LOWDRIVE_PIN15_Disabled (0)                                    /*!< Reduced drive is disabled. */
#define DRV_SX1509_LOWDRIVE_PIN15_Enabled  (1)                                    /*!< Reduced drive is enabled. */


/* Field PIN14: Enables/Disables reduced drive of the output buffer of each [output-configured] IO. */
#define DRV_SX1509_LOWDRIVE_PIN14_Pos      (14)                                   /*!< The position of the field. */
#define DRV_SX1509_LOWDRIVE_PIN14_Msk      (0x1 << DRV_SX1509_LOWDRIVE_PIN14_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LOWDRIVE_PIN14_Disabled (0)                                    /*!< Reduced drive is disabled. */
#define DRV_SX1509_LOWDRIVE_PIN14_Enabled  (1)                                    /*!< Reduced drive is enabled. */


/* Field PIN13: Enables/Disables reduced drive of the output buffer of each [output-configured] IO. */
#define DRV_SX1509_LOWDRIVE_PIN13_Pos      (13)                                   /*!< The position of the field. */
#define DRV_SX1509_LOWDRIVE_PIN13_Msk      (0x1 << DRV_SX1509_LOWDRIVE_PIN13_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LOWDRIVE_PIN13_Disabled (0)                                    /*!< Reduced drive is disabled. */
#define DRV_SX1509_LOWDRIVE_PIN13_Enabled  (1)                                    /*!< Reduced drive is enabled. */


/* Field PIN12: Enables/Disables reduced drive of the output buffer of each [output-configured] IO. */
#define DRV_SX1509_LOWDRIVE_PIN12_Pos      (12)                                   /*!< The position of the field. */
#define DRV_SX1509_LOWDRIVE_PIN12_Msk      (0x1 << DRV_SX1509_LOWDRIVE_PIN12_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LOWDRIVE_PIN12_Disabled (0)                                    /*!< Reduced drive is disabled. */
#define DRV_SX1509_LOWDRIVE_PIN12_Enabled  (1)                                    /*!< Reduced drive is enabled. */


/* Field PIN11: Enables/Disables reduced drive of the output buffer of each [output-configured] IO. */
#define DRV_SX1509_LOWDRIVE_PIN11_Pos      (11)                                   /*!< The position of the field. */
#define DRV_SX1509_LOWDRIVE_PIN11_Msk      (0x1 << DRV_SX1509_LOWDRIVE_PIN11_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LOWDRIVE_PIN11_Disabled (0)                                    /*!< Reduced drive is disabled. */
#define DRV_SX1509_LOWDRIVE_PIN11_Enabled  (1)                                    /*!< Reduced drive is enabled. */


/* Field PIN10: Enables/Disables reduced drive of the output buffer of each [output-configured] IO. */
#define DRV_SX1509_LOWDRIVE_PIN10_Pos      (10)                                   /*!< The position of the field. */
#define DRV_SX1509_LOWDRIVE_PIN10_Msk      (0x1 << DRV_SX1509_LOWDRIVE_PIN10_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LOWDRIVE_PIN10_Disabled (0)                                    /*!< Reduced drive is disabled. */
#define DRV_SX1509_LOWDRIVE_PIN10_Enabled  (1)                                    /*!< Reduced drive is enabled. */


/* Field PIN9: Enables/Disables reduced drive of the output buffer of each [output-configured] IO. */
#define DRV_SX1509_LOWDRIVE_PIN9_Pos      (9)                                   /*!< The position of the field. */
#define DRV_SX1509_LOWDRIVE_PIN9_Msk      (0x1 << DRV_SX1509_LOWDRIVE_PIN9_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LOWDRIVE_PIN9_Disabled (0)                                   /*!< Reduced drive is disabled. */
#define DRV_SX1509_LOWDRIVE_PIN9_Enabled  (1)                                   /*!< Reduced drive is enabled. */


/* Field PIN8: Enables/Disables reduced drive of the output buffer of each [output-configured] IO. */
#define DRV_SX1509_LOWDRIVE_PIN8_Pos      (8)                                   /*!< The position of the field. */
#define DRV_SX1509_LOWDRIVE_PIN8_Msk      (0x1 << DRV_SX1509_LOWDRIVE_PIN8_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LOWDRIVE_PIN8_Disabled (0)                                   /*!< Reduced drive is disabled. */
#define DRV_SX1509_LOWDRIVE_PIN8_Enabled  (1)                                   /*!< Reduced drive is enabled. */


/* Field PIN7: Enables/Disables reduced drive of the output buffer of each [output-configured] IO. */
#define DRV_SX1509_LOWDRIVE_PIN7_Pos      (7)                                   /*!< The position of the field. */
#define DRV_SX1509_LOWDRIVE_PIN7_Msk      (0x1 << DRV_SX1509_LOWDRIVE_PIN7_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LOWDRIVE_PIN7_Disabled (0)                                   /*!< Reduced drive is disabled. */
#define DRV_SX1509_LOWDRIVE_PIN7_Enabled  (1)                                   /*!< Reduced drive is enabled. */


/* Field PIN6: Enables/Disables reduced drive of the output buffer of each [output-configured] IO. */
#define DRV_SX1509_LOWDRIVE_PIN6_Pos      (6)                                   /*!< The position of the field. */
#define DRV_SX1509_LOWDRIVE_PIN6_Msk      (0x1 << DRV_SX1509_LOWDRIVE_PIN6_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LOWDRIVE_PIN6_Disabled (0)                                   /*!< Reduced drive is disabled. */
#define DRV_SX1509_LOWDRIVE_PIN6_Enabled  (1)                                   /*!< Reduced drive is enabled. */


/* Field PIN5: Enables/Disables reduced drive of the output buffer of each [output-configured] IO. */
#define DRV_SX1509_LOWDRIVE_PIN5_Pos      (5)                                   /*!< The position of the field. */
#define DRV_SX1509_LOWDRIVE_PIN5_Msk      (0x1 << DRV_SX1509_LOWDRIVE_PIN5_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LOWDRIVE_PIN5_Disabled (0)                                   /*!< Reduced drive is disabled. */
#define DRV_SX1509_LOWDRIVE_PIN5_Enabled  (1)                                   /*!< Reduced drive is enabled. */


/* Field PIN4: Enables/Disables reduced drive of the output buffer of each [output-configured] IO. */
#define DRV_SX1509_LOWDRIVE_PIN4_Pos      (4)                                   /*!< The position of the field. */
#define DRV_SX1509_LOWDRIVE_PIN4_Msk      (0x1 << DRV_SX1509_LOWDRIVE_PIN4_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LOWDRIVE_PIN4_Disabled (0)                                   /*!< Reduced drive is disabled. */
#define DRV_SX1509_LOWDRIVE_PIN4_Enabled  (1)                                   /*!< Reduced drive is enabled. */


/* Field PIN3: Enables/Disables reduced drive of the output buffer of each [output-configured] IO. */
#define DRV_SX1509_LOWDRIVE_PIN3_Pos      (3)                                   /*!< The position of the field. */
#define DRV_SX1509_LOWDRIVE_PIN3_Msk      (0x1 << DRV_SX1509_LOWDRIVE_PIN3_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LOWDRIVE_PIN3_Disabled (0)                                   /*!< Reduced drive is disabled. */
#define DRV_SX1509_LOWDRIVE_PIN3_Enabled  (1)                                   /*!< Reduced drive is enabled. */


/* Field PIN2: Enables/Disables reduced drive of the output buffer of each [output-configured] IO. */
#define DRV_SX1509_LOWDRIVE_PIN2_Pos      (2)                                   /*!< The position of the field. */
#define DRV_SX1509_LOWDRIVE_PIN2_Msk      (0x1 << DRV_SX1509_LOWDRIVE_PIN2_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LOWDRIVE_PIN2_Disabled (0)                                   /*!< Reduced drive is disabled. */
#define DRV_SX1509_LOWDRIVE_PIN2_Enabled  (1)                                   /*!< Reduced drive is enabled. */


/* Field PIN1: Enables/Disables reduced drive of the output buffer of each [output-configured] IO. */
#define DRV_SX1509_LOWDRIVE_PIN1_Pos      (1)                                   /*!< The position of the field. */
#define DRV_SX1509_LOWDRIVE_PIN1_Msk      (0x1 << DRV_SX1509_LOWDRIVE_PIN1_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LOWDRIVE_PIN1_Disabled (0)                                   /*!< Reduced drive is disabled. */
#define DRV_SX1509_LOWDRIVE_PIN1_Enabled  (1)                                   /*!< Reduced drive is enabled. */


/* Field PIN0: Enables/Disables reduced drive of the output buffer of each [output-configured] IO. */
#define DRV_SX1509_LOWDRIVE_PIN0_Pos      (0)                                   /*!< The position of the field. */
#define DRV_SX1509_LOWDRIVE_PIN0_Msk      (0x1 << DRV_SX1509_LOWDRIVE_PIN0_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LOWDRIVE_PIN0_Disabled (0)                                   /*!< Reduced drive is disabled. */
#define DRV_SX1509_LOWDRIVE_PIN0_Enabled  (1)                                   /*!< Reduced drive is enabled. */


/* Register: PULLUP. */
/* Description: Pull-up register. */


