NordicPlayground/nrf528xx-ble-throughput-demo/display_shield_files/inc/drv_sx1509_bitfields.h
/* Field PIN2: Enables/Disables the pull-up for each IO. */
#define DRV_SX1509_PULLUP_PIN2_Pos      (2)                                 /*!< The position of the field. */
#define DRV_SX1509_PULLUP_PIN2_Msk      (0x1 << DRV_SX1509_PULLUP_PIN2_Pos) /*!< The mask of the field. */
#define DRV_SX1509_PULLUP_PIN2_Disabled (0)                                 /*!< Pull-up is disabled. */
#define DRV_SX1509_PULLUP_PIN2_Enabled  (1)                                 /*!< Pull-up is enabled. */


/* Field PIN1: Enables/Disables the pull-up for each IO. */
#define DRV_SX1509_PULLUP_PIN1_Pos      (1)                                 /*!< The position of the field. */
#define DRV_SX1509_PULLUP_PIN1_Msk      (0x1 << DRV_SX1509_PULLUP_PIN1_Pos) /*!< The mask of the field. */
#define DRV_SX1509_PULLUP_PIN1_Disabled (0)                                 /*!< Pull-up is disabled. */
#define DRV_SX1509_PULLUP_PIN1_Enabled  (1)                                 /*!< Pull-up is enabled. */


/* Field PIN0: Enables/Disables the pull-up for each IO. */
#define DRV_SX1509_PULLUP_PIN0_Pos      (0)                                 /*!< The position of the field. */
#define DRV_SX1509_PULLUP_PIN0_Msk      (0x1 << DRV_SX1509_PULLUP_PIN0_Pos) /*!< The mask of the field. */
#define DRV_SX1509_PULLUP_PIN0_Disabled (0)                                 /*!< Pull-up is disabled. */
#define DRV_SX1509_PULLUP_PIN0_Enabled  (1)                                 /*!< Pull-up is enabled. */


/* Register: PULLDOWN. */
/* Description: Pull-down register. */


/* Field PIN15: Enables/Disables pull-down for each IO. */
#define DRV_SX1509_PULLDOWN_PIN15_Pos      (15)                                   /*!< The position of the field. */
#define DRV_SX1509_PULLDOWN_PIN15_Msk      (0x1 << DRV_SX1509_PULLDOWN_PIN15_Pos) /*!< The mask of the field. */
#define DRV_SX1509_PULLDOWN_PIN15_Disabled (0)                                    /*!< Pull-down is disabled. */
#define DRV_SX1509_PULLDOWN_PIN15_Enabled  (1)                                    /*!< Pull-down is enabled. */


/* Field PIN14: Enables/Disables pull-down for each IO. */
#define DRV_SX1509_PULLDOWN_PIN14_Pos      (14)                                   /*!< The position of the field. */
#define DRV_SX1509_PULLDOWN_PIN14_Msk      (0x1 << DRV_SX1509_PULLDOWN_PIN14_Pos) /*!< The mask of the field. */
#define DRV_SX1509_PULLDOWN_PIN14_Disabled (0)                                    /*!< Pull-down is disabled. */
#define DRV_SX1509_PULLDOWN_PIN14_Enabled  (1)                                    /*!< Pull-down is enabled. */


/* Field PIN13: Enables/Disables pull-down for each IO. */
#define DRV_SX1509_PULLDOWN_PIN13_Pos      (13)                                   /*!< The position of the field. */
#define DRV_SX1509_PULLDOWN_PIN13_Msk      (0x1 << DRV_SX1509_PULLDOWN_PIN13_Pos) /*!< The mask of the field. */
#define DRV_SX1509_PULLDOWN_PIN13_Disabled (0)                                    /*!< Pull-down is disabled. */
#define DRV_SX1509_PULLDOWN_PIN13_Enabled  (1)                                    /*!< Pull-down is enabled. */


/* Field PIN12: Enables/Disables pull-down for each IO. */
#define DRV_SX1509_PULLDOWN_PIN12_Pos      (12)                                   /*!< The position of the field. */
#define DRV_SX1509_PULLDOWN_PIN12_Msk      (0x1 << DRV_SX1509_PULLDOWN_PIN12_Pos) /*!< The mask of the field. */
#define DRV_SX1509_PULLDOWN_PIN12_Disabled (0)                                    /*!< Pull-down is disabled. */
#define DRV_SX1509_PULLDOWN_PIN12_Enabled  (1)                                    /*!< Pull-down is enabled. */


/* Field PIN11: Enables/Disables pull-down for each IO. */
#define DRV_SX1509_PULLDOWN_PIN11_Pos      (11)                                   /*!< The position of the field. */
#define DRV_SX1509_PULLDOWN_PIN11_Msk      (0x1 << DRV_SX1509_PULLDOWN_PIN11_Pos) /*!< The mask of the field. */
#define DRV_SX1509_PULLDOWN_PIN11_Disabled (0)                                    /*!< Pull-down is disabled. */
#define DRV_SX1509_PULLDOWN_PIN11_Enabled  (1)                                    /*!< Pull-down is enabled. */


/* Field PIN10: Enables/Disables pull-down for each IO. */
#define DRV_SX1509_PULLDOWN_PIN10_Pos      (10)                                   /*!< The position of the field. */
#define DRV_SX1509_PULLDOWN_PIN10_Msk      (0x1 << DRV_SX1509_PULLDOWN_PIN10_Pos) /*!< The mask of the field. */
#define DRV_SX1509_PULLDOWN_PIN10_Disabled (0)                                    /*!< Pull-down is disabled. */
#define DRV_SX1509_PULLDOWN_PIN10_Enabled  (1)                                    /*!< Pull-down is enabled. */


/* Field PIN9: Enables/Disables pull-down for each IO. */
#define DRV_SX1509_PULLDOWN_PIN9_Pos      (9)                                   /*!< The position of the field. */
#define DRV_SX1509_PULLDOWN_PIN9_Msk      (0x1 << DRV_SX1509_PULLDOWN_PIN9_Pos) /*!< The mask of the field. */
#define DRV_SX1509_PULLDOWN_PIN9_Disabled (0)                                   /*!< Pull-down is disabled. */
#define DRV_SX1509_PULLDOWN_PIN9_Enabled  (1)                                   /*!< Pull-down is enabled. */


/* Field PIN8: Enables/Disables pull-down for each IO. */
#define DRV_SX1509_PULLDOWN_PIN8_Pos      (8)                                   /*!< The position of the field. */
#define DRV_SX1509_PULLDOWN_PIN8_Msk      (0x1 << DRV_SX1509_PULLDOWN_PIN8_Pos) /*!< The mask of the field. */
#define DRV_SX1509_PULLDOWN_PIN8_Disabled (0)                                   /*!< Pull-down is disabled. */
#define DRV_SX1509_PULLDOWN_PIN8_Enabled  (1)                                   /*!< Pull-down is enabled. */


/* Field PIN7: Enables/Disables pull-down for each IO. */
#define DRV_SX1509_PULLDOWN_PIN7_Pos      (7)                                   /*!< The position of the field. */
#define DRV_SX1509_PULLDOWN_PIN7_Msk      (0x1 << DRV_SX1509_PULLDOWN_PIN7_Pos) /*!< The mask of the field. */
#define DRV_SX1509_PULLDOWN_PIN7_Disabled (0)                                   /*!< Pull-down is disabled. */
#define DRV_SX1509_PULLDOWN_PIN7_Enabled  (1)                                   /*!< Pull-down is enabled. */


