NordicPlayground/nrf528xx-ble-throughput-demo/display_shield_files/inc/drv_sx1509_bitfields.h
/* Field PIN6: Enables/Disables pull-down for each IO. */
#define DRV_SX1509_PULLDOWN_PIN6_Pos      (6)                                   /*!< The position of the field. */
#define DRV_SX1509_PULLDOWN_PIN6_Msk      (0x1 << DRV_SX1509_PULLDOWN_PIN6_Pos) /*!< The mask of the field. */
#define DRV_SX1509_PULLDOWN_PIN6_Disabled (0)                                   /*!< Pull-down is disabled. */
#define DRV_SX1509_PULLDOWN_PIN6_Enabled  (1)                                   /*!< Pull-down is enabled. */


/* Field PIN5: Enables/Disables pull-down for each IO. */
#define DRV_SX1509_PULLDOWN_PIN5_Pos      (5)                                   /*!< The position of the field. */
#define DRV_SX1509_PULLDOWN_PIN5_Msk      (0x1 << DRV_SX1509_PULLDOWN_PIN5_Pos) /*!< The mask of the field. */
#define DRV_SX1509_PULLDOWN_PIN5_Disabled (0)                                   /*!< Pull-down is disabled. */
#define DRV_SX1509_PULLDOWN_PIN5_Enabled  (1)                                   /*!< Pull-down is enabled. */


/* Field PIN4: Enables/Disables pull-down for each IO. */
#define DRV_SX1509_PULLDOWN_PIN4_Pos      (4)                                   /*!< The position of the field. */
#define DRV_SX1509_PULLDOWN_PIN4_Msk      (0x1 << DRV_SX1509_PULLDOWN_PIN4_Pos) /*!< The mask of the field. */
#define DRV_SX1509_PULLDOWN_PIN4_Disabled (0)                                   /*!< Pull-down is disabled. */
#define DRV_SX1509_PULLDOWN_PIN4_Enabled  (1)                                   /*!< Pull-down is enabled. */


/* Field PIN3: Enables/Disables pull-down for each IO. */
#define DRV_SX1509_PULLDOWN_PIN3_Pos      (3)                                   /*!< The position of the field. */
#define DRV_SX1509_PULLDOWN_PIN3_Msk      (0x1 << DRV_SX1509_PULLDOWN_PIN3_Pos) /*!< The mask of the field. */
#define DRV_SX1509_PULLDOWN_PIN3_Disabled (0)                                   /*!< Pull-down is disabled. */
#define DRV_SX1509_PULLDOWN_PIN3_Enabled  (1)                                   /*!< Pull-down is enabled. */


/* Field PIN2: Enables/Disables pull-down for each IO. */
#define DRV_SX1509_PULLDOWN_PIN2_Pos      (2)                                   /*!< The position of the field. */
#define DRV_SX1509_PULLDOWN_PIN2_Msk      (0x1 << DRV_SX1509_PULLDOWN_PIN2_Pos) /*!< The mask of the field. */
#define DRV_SX1509_PULLDOWN_PIN2_Disabled (0)                                   /*!< Pull-down is disabled. */
#define DRV_SX1509_PULLDOWN_PIN2_Enabled  (1)                                   /*!< Pull-down is enabled. */


/* Field PIN1: Enables/Disables pull-down for each IO. */
#define DRV_SX1509_PULLDOWN_PIN1_Pos      (1)                                   /*!< The position of the field. */
#define DRV_SX1509_PULLDOWN_PIN1_Msk      (0x1 << DRV_SX1509_PULLDOWN_PIN1_Pos) /*!< The mask of the field. */
#define DRV_SX1509_PULLDOWN_PIN1_Disabled (0)                                   /*!< Pull-down is disabled. */
#define DRV_SX1509_PULLDOWN_PIN1_Enabled  (1)                                   /*!< Pull-down is enabled. */


/* Field PIN0: Enables/Disables pull-down for each IO. */
#define DRV_SX1509_PULLDOWN_PIN0_Pos      (0)                                   /*!< The position of the field. */
#define DRV_SX1509_PULLDOWN_PIN0_Msk      (0x1 << DRV_SX1509_PULLDOWN_PIN0_Pos) /*!< The mask of the field. */
#define DRV_SX1509_PULLDOWN_PIN0_Disabled (0)                                   /*!< Pull-down is disabled. */
#define DRV_SX1509_PULLDOWN_PIN0_Enabled  (1)                                   /*!< Pull-down is enabled. */


/* Register: OPENDRAIN. */
/* Description: Enables/Disables open drain operation for each [output-configured] IO. */


/* Field PIN15: Enables/Disables open drain operation for each [output-configured] IO. */
#define DRV_SX1509_OPENDRAIN_PIN15_Pos       (15)                                    /*!< The position of the field. */
#define DRV_SX1509_OPENDRAIN_PIN15_Msk       (0x1 << DRV_SX1509_OPENDRAIN_PIN15_Pos) /*!< The mask of the field. */
#define DRV_SX1509_OPENDRAIN_PIN15_PushPull  (0)                                     /*!< Regular push-pull operation. */
#define DRV_SX1509_OPENDRAIN_PIN15_OpenDrain (1)                                     /*!< Open drain operation. */


/* Field PIN14: Enables/Disables open drain operation for each [output-configured] IO. */
#define DRV_SX1509_OPENDRAIN_PIN14_Pos       (14)                                    /*!< The position of the field. */
#define DRV_SX1509_OPENDRAIN_PIN14_Msk       (0x1 << DRV_SX1509_OPENDRAIN_PIN14_Pos) /*!< The mask of the field. */
#define DRV_SX1509_OPENDRAIN_PIN14_PushPull  (0)                                     /*!< Regular push-pull operation. */
#define DRV_SX1509_OPENDRAIN_PIN14_OpenDrain (1)                                     /*!< Open drain operation. */


/* Field PIN13: Enables/Disables open drain operation for each [output-configured] IO. */
#define DRV_SX1509_OPENDRAIN_PIN13_Pos       (13)                                    /*!< The position of the field. */
#define DRV_SX1509_OPENDRAIN_PIN13_Msk       (0x1 << DRV_SX1509_OPENDRAIN_PIN13_Pos) /*!< The mask of the field. */
#define DRV_SX1509_OPENDRAIN_PIN13_PushPull  (0)                                     /*!< Regular push-pull operation. */
#define DRV_SX1509_OPENDRAIN_PIN13_OpenDrain (1)                                     /*!< Open drain operation. */


/* Field PIN12: Enables/Disables open drain operation for each [output-configured] IO. */
#define DRV_SX1509_OPENDRAIN_PIN12_Pos       (12)                                    /*!< The position of the field. */
#define DRV_SX1509_OPENDRAIN_PIN12_Msk       (0x1 << DRV_SX1509_OPENDRAIN_PIN12_Pos) /*!< The mask of the field. */
#define DRV_SX1509_OPENDRAIN_PIN12_PushPull  (0)                                     /*!< Regular push-pull operation. */
#define DRV_SX1509_OPENDRAIN_PIN12_OpenDrain (1)                                     /*!< Open drain operation. */


/* Field PIN11: Enables/Disables open drain operation for each [output-configured] IO. */
#define DRV_SX1509_OPENDRAIN_PIN11_Pos       (11)                                    /*!< The position of the field. */
#define DRV_SX1509_OPENDRAIN_PIN11_Msk       (0x1 << DRV_SX1509_OPENDRAIN_PIN11_Pos) /*!< The mask of the field. */
#define DRV_SX1509_OPENDRAIN_PIN11_PushPull  (0)                                     /*!< Regular push-pull operation. */
#define DRV_SX1509_OPENDRAIN_PIN11_OpenDrain (1)                                     /*!< Open drain operation. */


/* Field PIN10: Enables/Disables open drain operation for each [output-configured] IO. */
#define DRV_SX1509_OPENDRAIN_PIN10_Pos       (10)                                    /*!< The position of the field. */
#define DRV_SX1509_OPENDRAIN_PIN10_Msk       (0x1 << DRV_SX1509_OPENDRAIN_PIN10_Pos) /*!< The mask of the field. */
#define DRV_SX1509_OPENDRAIN_PIN10_PushPull  (0)                                     /*!< Regular push-pull operation. */
#define DRV_SX1509_OPENDRAIN_PIN10_OpenDrain (1)                                     /*!< Open drain operation. */


/* Field PIN9: Enables/Disables open drain operation for each [output-configured] IO. */
#define DRV_SX1509_OPENDRAIN_PIN9_Pos       (9)                                    /*!< The position of the field. */
#define DRV_SX1509_OPENDRAIN_PIN9_Msk       (0x1 << DRV_SX1509_OPENDRAIN_PIN9_Pos) /*!< The mask of the field. */
#define DRV_SX1509_OPENDRAIN_PIN9_PushPull  (0)                                    /*!< Regular push-pull operation. */
#define DRV_SX1509_OPENDRAIN_PIN9_OpenDrain (1)                                    /*!< Open drain operation. */


/* Field PIN8: Enables/Disables open drain operation for each [output-configured] IO. */
#define DRV_SX1509_OPENDRAIN_PIN8_Pos       (8)                                    /*!< The position of the field. */
#define DRV_SX1509_OPENDRAIN_PIN8_Msk       (0x1 << DRV_SX1509_OPENDRAIN_PIN8_Pos) /*!< The mask of the field. */
#define DRV_SX1509_OPENDRAIN_PIN8_PushPull  (0)                                    /*!< Regular push-pull operation. */
#define DRV_SX1509_OPENDRAIN_PIN8_OpenDrain (1)                                    /*!< Open drain operation. */


/* Field PIN7: Enables/Disables open drain operation for each [output-configured] IO. */
#define DRV_SX1509_OPENDRAIN_PIN7_Pos       (7)                                    /*!< The position of the field. */
#define DRV_SX1509_OPENDRAIN_PIN7_Msk       (0x1 << DRV_SX1509_OPENDRAIN_PIN7_Pos) /*!< The mask of the field. */
#define DRV_SX1509_OPENDRAIN_PIN7_PushPull  (0)                                    /*!< Regular push-pull operation. */
#define DRV_SX1509_OPENDRAIN_PIN7_OpenDrain (1)                                    /*!< Open drain operation. */


/* Field PIN6: Enables/Disables open drain operation for each [output-configured] IO. */
#define DRV_SX1509_OPENDRAIN_PIN6_Pos       (6)                                    /*!< The position of the field. */
#define DRV_SX1509_OPENDRAIN_PIN6_Msk       (0x1 << DRV_SX1509_OPENDRAIN_PIN6_Pos) /*!< The mask of the field. */
#define DRV_SX1509_OPENDRAIN_PIN6_PushPull  (0)                                    /*!< Regular push-pull operation. */
#define DRV_SX1509_OPENDRAIN_PIN6_OpenDrain (1)                                    /*!< Open drain operation. */


