NordicPlayground/nrf528xx-ble-throughput-demo/display_shield_files/inc/drv_sx1509_bitfields.h
/* Field PIN5: Enables/Disables open drain operation for each [output-configured] IO. */
#define DRV_SX1509_OPENDRAIN_PIN5_Pos       (5)                                    /*!< The position of the field. */
#define DRV_SX1509_OPENDRAIN_PIN5_Msk       (0x1 << DRV_SX1509_OPENDRAIN_PIN5_Pos) /*!< The mask of the field. */
#define DRV_SX1509_OPENDRAIN_PIN5_PushPull  (0)                                    /*!< Regular push-pull operation. */
#define DRV_SX1509_OPENDRAIN_PIN5_OpenDrain (1)                                    /*!< Open drain operation. */


/* Field PIN4: Enables/Disables open drain operation for each [output-configured] IO. */
#define DRV_SX1509_OPENDRAIN_PIN4_Pos       (4)                                    /*!< The position of the field. */
#define DRV_SX1509_OPENDRAIN_PIN4_Msk       (0x1 << DRV_SX1509_OPENDRAIN_PIN4_Pos) /*!< The mask of the field. */
#define DRV_SX1509_OPENDRAIN_PIN4_PushPull  (0)                                    /*!< Regular push-pull operation. */
#define DRV_SX1509_OPENDRAIN_PIN4_OpenDrain (1)                                    /*!< Open drain operation. */


/* Field PIN3: Enables/Disables open drain operation for each [output-configured] IO. */
#define DRV_SX1509_OPENDRAIN_PIN3_Pos       (3)                                    /*!< The position of the field. */
#define DRV_SX1509_OPENDRAIN_PIN3_Msk       (0x1 << DRV_SX1509_OPENDRAIN_PIN3_Pos) /*!< The mask of the field. */
#define DRV_SX1509_OPENDRAIN_PIN3_PushPull  (0)                                    /*!< Regular push-pull operation. */
#define DRV_SX1509_OPENDRAIN_PIN3_OpenDrain (1)                                    /*!< Open drain operation. */


/* Field PIN2: Enables/Disables open drain operation for each [output-configured] IO. */
#define DRV_SX1509_OPENDRAIN_PIN2_Pos       (2)                                    /*!< The position of the field. */
#define DRV_SX1509_OPENDRAIN_PIN2_Msk       (0x1 << DRV_SX1509_OPENDRAIN_PIN2_Pos) /*!< The mask of the field. */
#define DRV_SX1509_OPENDRAIN_PIN2_PushPull  (0)                                    /*!< Regular push-pull operation. */
#define DRV_SX1509_OPENDRAIN_PIN2_OpenDrain (1)                                    /*!< Open drain operation. */


/* Field PIN1: Enables/Disables open drain operation for each [output-configured] IO. */
#define DRV_SX1509_OPENDRAIN_PIN1_Pos       (1)                                    /*!< The position of the field. */
#define DRV_SX1509_OPENDRAIN_PIN1_Msk       (0x1 << DRV_SX1509_OPENDRAIN_PIN1_Pos) /*!< The mask of the field. */
#define DRV_SX1509_OPENDRAIN_PIN1_PushPull  (0)                                    /*!< Regular push-pull operation. */
#define DRV_SX1509_OPENDRAIN_PIN1_OpenDrain (1)                                    /*!< Open drain operation. */


/* Field PIN0: Enables/Disables open drain operation for each [output-configured] IO. */
#define DRV_SX1509_OPENDRAIN_PIN0_Pos       (0)                                    /*!< The position of the field. */
#define DRV_SX1509_OPENDRAIN_PIN0_Msk       (0x1 << DRV_SX1509_OPENDRAIN_PIN0_Pos) /*!< The mask of the field. */
#define DRV_SX1509_OPENDRAIN_PIN0_PushPull  (0)                                    /*!< Regular push-pull operation. */
#define DRV_SX1509_OPENDRAIN_PIN0_OpenDrain (1)                                    /*!< Open drain operation. */


/* Register: POLARITY. */
/* Description: Enables/Disables polarity inversion for each IO. */


/* Field PIN15: Enables/Disables polarity inversion for each IO. */
#define DRV_SX1509_POLARITY_PIN15_Pos      (15)                                   /*!< The position of the field. */
#define DRV_SX1509_POLARITY_PIN15_Msk      (0x1 << DRV_SX1509_POLARITY_PIN15_Pos) /*!< The mask of the field. */
#define DRV_SX1509_POLARITY_PIN15_Normal   (0)                                    /*!< Normal polarity : RegData[x] = IO[x]. */
#define DRV_SX1509_POLARITY_PIN15_Inverted (1)                                    /*!< Inverted polarity : RegData[x] = !IO[x] (for both input and output configured IOs). */


/* Field PIN14: Enables/Disables polarity inversion for each IO. */
#define DRV_SX1509_POLARITY_PIN14_Pos      (14)                                   /*!< The position of the field. */
#define DRV_SX1509_POLARITY_PIN14_Msk      (0x1 << DRV_SX1509_POLARITY_PIN14_Pos) /*!< The mask of the field. */
#define DRV_SX1509_POLARITY_PIN14_Normal   (0)                                    /*!< Normal polarity : RegData[x] = IO[x]. */
#define DRV_SX1509_POLARITY_PIN14_Inverted (1)                                    /*!< Inverted polarity : RegData[x] = !IO[x] (for both input and output configured IOs). */


/* Field PIN13: Enables/Disables polarity inversion for each IO. */
#define DRV_SX1509_POLARITY_PIN13_Pos      (13)                                   /*!< The position of the field. */
#define DRV_SX1509_POLARITY_PIN13_Msk      (0x1 << DRV_SX1509_POLARITY_PIN13_Pos) /*!< The mask of the field. */
#define DRV_SX1509_POLARITY_PIN13_Normal   (0)                                    /*!< Normal polarity : RegData[x] = IO[x]. */
#define DRV_SX1509_POLARITY_PIN13_Inverted (1)                                    /*!< Inverted polarity : RegData[x] = !IO[x] (for both input and output configured IOs). */


/* Field PIN12: Enables/Disables polarity inversion for each IO. */
#define DRV_SX1509_POLARITY_PIN12_Pos      (12)                                   /*!< The position of the field. */
#define DRV_SX1509_POLARITY_PIN12_Msk      (0x1 << DRV_SX1509_POLARITY_PIN12_Pos) /*!< The mask of the field. */
#define DRV_SX1509_POLARITY_PIN12_Normal   (0)                                    /*!< Normal polarity : RegData[x] = IO[x]. */
#define DRV_SX1509_POLARITY_PIN12_Inverted (1)                                    /*!< Inverted polarity : RegData[x] = !IO[x] (for both input and output configured IOs). */


/* Field PIN11: Enables/Disables polarity inversion for each IO. */
#define DRV_SX1509_POLARITY_PIN11_Pos      (11)                                   /*!< The position of the field. */
#define DRV_SX1509_POLARITY_PIN11_Msk      (0x1 << DRV_SX1509_POLARITY_PIN11_Pos) /*!< The mask of the field. */
#define DRV_SX1509_POLARITY_PIN11_Normal   (0)                                    /*!< Normal polarity : RegData[x] = IO[x]. */
#define DRV_SX1509_POLARITY_PIN11_Inverted (1)                                    /*!< Inverted polarity : RegData[x] = !IO[x] (for both input and output configured IOs). */


