NordicPlayground/nrf528xx-ble-throughput-demo/display_shield_files/inc/drv_sx1509_bitfields.h
/* Field PIN10: Enables/Disables polarity inversion for each IO. */
#define DRV_SX1509_POLARITY_PIN10_Pos      (10)                                   /*!< The position of the field. */
#define DRV_SX1509_POLARITY_PIN10_Msk      (0x1 << DRV_SX1509_POLARITY_PIN10_Pos) /*!< The mask of the field. */
#define DRV_SX1509_POLARITY_PIN10_Normal   (0)                                    /*!< Normal polarity : RegData[x] = IO[x]. */
#define DRV_SX1509_POLARITY_PIN10_Inverted (1)                                    /*!< Inverted polarity : RegData[x] = !IO[x] (for both input and output configured IOs). */


/* Field PIN9: Enables/Disables polarity inversion for each IO. */
#define DRV_SX1509_POLARITY_PIN9_Pos      (9)                                   /*!< The position of the field. */
#define DRV_SX1509_POLARITY_PIN9_Msk      (0x1 << DRV_SX1509_POLARITY_PIN9_Pos) /*!< The mask of the field. */
#define DRV_SX1509_POLARITY_PIN9_Normal   (0)                                   /*!< Normal polarity : RegData[x] = IO[x]. */
#define DRV_SX1509_POLARITY_PIN9_Inverted (1)                                   /*!< Inverted polarity : RegData[x] = !IO[x] (for both input and output configured IOs). */


/* Field PIN8: Enables/Disables polarity inversion for each IO. */
#define DRV_SX1509_POLARITY_PIN8_Pos      (8)                                   /*!< The position of the field. */
#define DRV_SX1509_POLARITY_PIN8_Msk      (0x1 << DRV_SX1509_POLARITY_PIN8_Pos) /*!< The mask of the field. */
#define DRV_SX1509_POLARITY_PIN8_Normal   (0)                                   /*!< Normal polarity : RegData[x] = IO[x]. */
#define DRV_SX1509_POLARITY_PIN8_Inverted (1)                                   /*!< Inverted polarity : RegData[x] = !IO[x] (for both input and output configured IOs). */


/* Field PIN7: Enables/Disables polarity inversion for each IO. */
#define DRV_SX1509_POLARITY_PIN7_Pos      (7)                                   /*!< The position of the field. */
#define DRV_SX1509_POLARITY_PIN7_Msk      (0x1 << DRV_SX1509_POLARITY_PIN7_Pos) /*!< The mask of the field. */
#define DRV_SX1509_POLARITY_PIN7_Normal   (0)                                   /*!< Normal polarity : RegData[x] = IO[x]. */
#define DRV_SX1509_POLARITY_PIN7_Inverted (1)                                   /*!< Inverted polarity : RegData[x] = !IO[x] (for both input and output configured IOs). */


/* Field PIN6: Enables/Disables polarity inversion for each IO. */
#define DRV_SX1509_POLARITY_PIN6_Pos      (6)                                   /*!< The position of the field. */
#define DRV_SX1509_POLARITY_PIN6_Msk      (0x1 << DRV_SX1509_POLARITY_PIN6_Pos) /*!< The mask of the field. */
#define DRV_SX1509_POLARITY_PIN6_Normal   (0)                                   /*!< Normal polarity : RegData[x] = IO[x]. */
#define DRV_SX1509_POLARITY_PIN6_Inverted (1)                                   /*!< Inverted polarity : RegData[x] = !IO[x] (for both input and output configured IOs). */


/* Field PIN5: Enables/Disables polarity inversion for each IO. */
#define DRV_SX1509_POLARITY_PIN5_Pos      (5)                                   /*!< The position of the field. */
#define DRV_SX1509_POLARITY_PIN5_Msk      (0x1 << DRV_SX1509_POLARITY_PIN5_Pos) /*!< The mask of the field. */
#define DRV_SX1509_POLARITY_PIN5_Normal   (0)                                   /*!< Normal polarity : RegData[x] = IO[x]. */
#define DRV_SX1509_POLARITY_PIN5_Inverted (1)                                   /*!< Inverted polarity : RegData[x] = !IO[x] (for both input and output configured IOs). */


/* Field PIN4: Enables/Disables polarity inversion for each IO. */
#define DRV_SX1509_POLARITY_PIN4_Pos      (4)                                   /*!< The position of the field. */
#define DRV_SX1509_POLARITY_PIN4_Msk      (0x1 << DRV_SX1509_POLARITY_PIN4_Pos) /*!< The mask of the field. */
#define DRV_SX1509_POLARITY_PIN4_Normal   (0)                                   /*!< Normal polarity : RegData[x] = IO[x]. */
#define DRV_SX1509_POLARITY_PIN4_Inverted (1)                                   /*!< Inverted polarity : RegData[x] = !IO[x] (for both input and output configured IOs). */


/* Field PIN3: Enables/Disables polarity inversion for each IO. */
#define DRV_SX1509_POLARITY_PIN3_Pos      (3)                                   /*!< The position of the field. */
#define DRV_SX1509_POLARITY_PIN3_Msk      (0x1 << DRV_SX1509_POLARITY_PIN3_Pos) /*!< The mask of the field. */
#define DRV_SX1509_POLARITY_PIN3_Normal   (0)                                   /*!< Normal polarity : RegData[x] = IO[x]. */
#define DRV_SX1509_POLARITY_PIN3_Inverted (1)                                   /*!< Inverted polarity : RegData[x] = !IO[x] (for both input and output configured IOs). */


/* Field PIN2: Enables/Disables polarity inversion for each IO. */
#define DRV_SX1509_POLARITY_PIN2_Pos      (2)                                   /*!< The position of the field. */
#define DRV_SX1509_POLARITY_PIN2_Msk      (0x1 << DRV_SX1509_POLARITY_PIN2_Pos) /*!< The mask of the field. */
#define DRV_SX1509_POLARITY_PIN2_Normal   (0)                                   /*!< Normal polarity : RegData[x] = IO[x]. */
#define DRV_SX1509_POLARITY_PIN2_Inverted (1)                                   /*!< Inverted polarity : RegData[x] = !IO[x] (for both input and output configured IOs). */


/* Field PIN1: Enables/Disables polarity inversion for each IO. */
#define DRV_SX1509_POLARITY_PIN1_Pos      (1)                                   /*!< The position of the field. */
#define DRV_SX1509_POLARITY_PIN1_Msk      (0x1 << DRV_SX1509_POLARITY_PIN1_Pos) /*!< The mask of the field. */
#define DRV_SX1509_POLARITY_PIN1_Normal   (0)                                   /*!< Normal polarity : RegData[x] = IO[x]. */
#define DRV_SX1509_POLARITY_PIN1_Inverted (1)                                   /*!< Inverted polarity : RegData[x] = !IO[x] (for both input and output configured IOs). */


