NordicPlayground/nrf528xx-ble-throughput-demo/display_shield_files/inc/drv_sx1509_bitfields.h
/* Field PIN0: Enables/Disables polarity inversion for each IO. */
#define DRV_SX1509_POLARITY_PIN0_Pos      (0)                                   /*!< The position of the field. */
#define DRV_SX1509_POLARITY_PIN0_Msk      (0x1 << DRV_SX1509_POLARITY_PIN0_Pos) /*!< The mask of the field. */
#define DRV_SX1509_POLARITY_PIN0_Normal   (0)                                   /*!< Normal polarity : RegData[x] = IO[x]. */
#define DRV_SX1509_POLARITY_PIN0_Inverted (1)                                   /*!< Inverted polarity : RegData[x] = !IO[x] (for both input and output configured IOs). */


/* Register: DIR. */
/* Description: Configures direction for each IO. */


/* Field PIN15: Configures direction for each IO. */
#define DRV_SX1509_DIR_PIN15_Pos    (15)                              /*!< The position of the field. */
#define DRV_SX1509_DIR_PIN15_Msk    (0x1 << DRV_SX1509_DIR_PIN15_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DIR_PIN15_Output (0)                               /*!< IO is configured as an output. */
#define DRV_SX1509_DIR_PIN15_Input  (1)                               /*!< IO is configured as an input. */


/* Field PIN14: Configures direction for each IO. */
#define DRV_SX1509_DIR_PIN14_Pos    (14)                              /*!< The position of the field. */
#define DRV_SX1509_DIR_PIN14_Msk    (0x1 << DRV_SX1509_DIR_PIN14_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DIR_PIN14_Output (0)                               /*!< IO is configured as an output. */
#define DRV_SX1509_DIR_PIN14_Input  (1)                               /*!< IO is configured as an input. */


/* Field PIN13: Configures direction for each IO. */
#define DRV_SX1509_DIR_PIN13_Pos    (13)                              /*!< The position of the field. */
#define DRV_SX1509_DIR_PIN13_Msk    (0x1 << DRV_SX1509_DIR_PIN13_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DIR_PIN13_Output (0)                               /*!< IO is configured as an output. */
#define DRV_SX1509_DIR_PIN13_Input  (1)                               /*!< IO is configured as an input. */


/* Field PIN12: Configures direction for each IO. */
#define DRV_SX1509_DIR_PIN12_Pos    (12)                              /*!< The position of the field. */
#define DRV_SX1509_DIR_PIN12_Msk    (0x1 << DRV_SX1509_DIR_PIN12_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DIR_PIN12_Output (0)                               /*!< IO is configured as an output. */
#define DRV_SX1509_DIR_PIN12_Input  (1)                               /*!< IO is configured as an input. */


/* Field PIN11: Configures direction for each IO. */
#define DRV_SX1509_DIR_PIN11_Pos    (11)                              /*!< The position of the field. */
#define DRV_SX1509_DIR_PIN11_Msk    (0x1 << DRV_SX1509_DIR_PIN11_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DIR_PIN11_Output (0)                               /*!< IO is configured as an output. */
#define DRV_SX1509_DIR_PIN11_Input  (1)                               /*!< IO is configured as an input. */


/* Field PIN10: Configures direction for each IO. */
#define DRV_SX1509_DIR_PIN10_Pos    (10)                              /*!< The position of the field. */
#define DRV_SX1509_DIR_PIN10_Msk    (0x1 << DRV_SX1509_DIR_PIN10_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DIR_PIN10_Output (0)                               /*!< IO is configured as an output. */
#define DRV_SX1509_DIR_PIN10_Input  (1)                               /*!< IO is configured as an input. */


/* Field PIN9: Configures direction for each IO. */
#define DRV_SX1509_DIR_PIN9_Pos    (9)                              /*!< The position of the field. */
#define DRV_SX1509_DIR_PIN9_Msk    (0x1 << DRV_SX1509_DIR_PIN9_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DIR_PIN9_Output (0)                              /*!< IO is configured as an output. */
#define DRV_SX1509_DIR_PIN9_Input  (1)                              /*!< IO is configured as an input. */


/* Field PIN8: Configures direction for each IO. */
#define DRV_SX1509_DIR_PIN8_Pos    (8)                              /*!< The position of the field. */
#define DRV_SX1509_DIR_PIN8_Msk    (0x1 << DRV_SX1509_DIR_PIN8_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DIR_PIN8_Output (0)                              /*!< IO is configured as an output. */
#define DRV_SX1509_DIR_PIN8_Input  (1)                              /*!< IO is configured as an input. */


/* Field PIN7: Configures direction for each IO. */
#define DRV_SX1509_DIR_PIN7_Pos    (7)                              /*!< The position of the field. */
#define DRV_SX1509_DIR_PIN7_Msk    (0x1 << DRV_SX1509_DIR_PIN7_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DIR_PIN7_Output (0)                              /*!< IO is configured as an output. */
#define DRV_SX1509_DIR_PIN7_Input  (1)                              /*!< IO is configured as an input. */


/* Field PIN6: Configures direction for each IO. */
#define DRV_SX1509_DIR_PIN6_Pos    (6)                              /*!< The position of the field. */
#define DRV_SX1509_DIR_PIN6_Msk    (0x1 << DRV_SX1509_DIR_PIN6_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DIR_PIN6_Output (0)                              /*!< IO is configured as an output. */
#define DRV_SX1509_DIR_PIN6_Input  (1)                              /*!< IO is configured as an input. */


/* Field PIN5: Configures direction for each IO. */
#define DRV_SX1509_DIR_PIN5_Pos    (5)                              /*!< The position of the field. */
#define DRV_SX1509_DIR_PIN5_Msk    (0x1 << DRV_SX1509_DIR_PIN5_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DIR_PIN5_Output (0)                              /*!< IO is configured as an output. */
#define DRV_SX1509_DIR_PIN5_Input  (1)                              /*!< IO is configured as an input. */


/* Field PIN4: Configures direction for each IO. */
#define DRV_SX1509_DIR_PIN4_Pos    (4)                              /*!< The position of the field. */
#define DRV_SX1509_DIR_PIN4_Msk    (0x1 << DRV_SX1509_DIR_PIN4_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DIR_PIN4_Output (0)                              /*!< IO is configured as an output. */
#define DRV_SX1509_DIR_PIN4_Input  (1)                              /*!< IO is configured as an input. */


/* Field PIN3: Configures direction for each IO. */
#define DRV_SX1509_DIR_PIN3_Pos    (3)                              /*!< The position of the field. */
#define DRV_SX1509_DIR_PIN3_Msk    (0x1 << DRV_SX1509_DIR_PIN3_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DIR_PIN3_Output (0)                              /*!< IO is configured as an output. */
#define DRV_SX1509_DIR_PIN3_Input  (1)                              /*!< IO is configured as an input. */


/* Field PIN2: Configures direction for each IO. */
#define DRV_SX1509_DIR_PIN2_Pos    (2)                              /*!< The position of the field. */
#define DRV_SX1509_DIR_PIN2_Msk    (0x1 << DRV_SX1509_DIR_PIN2_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DIR_PIN2_Output (0)                              /*!< IO is configured as an output. */
#define DRV_SX1509_DIR_PIN2_Input  (1)                              /*!< IO is configured as an input. */


