NordicPlayground/nrf528xx-ble-throughput-demo/display_shield_files/inc/drv_sx1509_bitfields.h
/* Field PIN1: Configures direction for each IO. */
#define DRV_SX1509_DIR_PIN1_Pos    (1)                              /*!< The position of the field. */
#define DRV_SX1509_DIR_PIN1_Msk    (0x1 << DRV_SX1509_DIR_PIN1_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DIR_PIN1_Output (0)                              /*!< IO is configured as an output. */
#define DRV_SX1509_DIR_PIN1_Input  (1)                              /*!< IO is configured as an input. */


/* Field PIN0: Configures direction for each IO. */
#define DRV_SX1509_DIR_PIN0_Pos    (0)                              /*!< The position of the field. */
#define DRV_SX1509_DIR_PIN0_Msk    (0x1 << DRV_SX1509_DIR_PIN0_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DIR_PIN0_Output (0)                              /*!< IO is configured as an output. */
#define DRV_SX1509_DIR_PIN0_Input  (1)                              /*!< IO is configured as an input. */


/* Register: DATA. */
/* Description: Data register - I/O. */


/* Field PIN15: Write: Data to be output to the output-configured IOs, Read: Data seen at the IOs, independent of the direction configured.. */
#define DRV_SX1509_DATA_PIN15_Pos  (15)                               /*!< The position of the field. */
#define DRV_SX1509_DATA_PIN15_Msk  (0x1 << DRV_SX1509_DATA_PIN15_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DATA_PIN15_Low  (0)                                /*!< IO is logical low. */
#define DRV_SX1509_DATA_PIN15_High (1)                                /*!< IO is logical high. */


/* Field PIN14: Write: Data to be output to the output-configured IOs, Read: Data seen at the IOs, independent of the direction configured.. */
#define DRV_SX1509_DATA_PIN14_Pos  (14)                               /*!< The position of the field. */
#define DRV_SX1509_DATA_PIN14_Msk  (0x1 << DRV_SX1509_DATA_PIN14_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DATA_PIN14_Low  (0)                                /*!< IO is logical low. */
#define DRV_SX1509_DATA_PIN14_High (1)                                /*!< IO is logical high. */


/* Field PIN13: Write: Data to be output to the output-configured IOs, Read: Data seen at the IOs, independent of the direction configured.. */
#define DRV_SX1509_DATA_PIN13_Pos  (13)                               /*!< The position of the field. */
#define DRV_SX1509_DATA_PIN13_Msk  (0x1 << DRV_SX1509_DATA_PIN13_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DATA_PIN13_Low  (0)                                /*!< IO is logical low. */
#define DRV_SX1509_DATA_PIN13_High (1)                                /*!< IO is logical high. */


/* Field PIN12: Write: Data to be output to the output-configured IOs, Read: Data seen at the IOs, independent of the direction configured.. */
#define DRV_SX1509_DATA_PIN12_Pos  (12)                               /*!< The position of the field. */
#define DRV_SX1509_DATA_PIN12_Msk  (0x1 << DRV_SX1509_DATA_PIN12_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DATA_PIN12_Low  (0)                                /*!< IO is logical low. */
#define DRV_SX1509_DATA_PIN12_High (1)                                /*!< IO is logical high. */


/* Field PIN11: Write: Data to be output to the output-configured IOs, Read: Data seen at the IOs, independent of the direction configured.. */
#define DRV_SX1509_DATA_PIN11_Pos  (11)                               /*!< The position of the field. */
#define DRV_SX1509_DATA_PIN11_Msk  (0x1 << DRV_SX1509_DATA_PIN11_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DATA_PIN11_Low  (0)                                /*!< IO is logical low. */
#define DRV_SX1509_DATA_PIN11_High (1)                                /*!< IO is logical high. */


/* Field PIN10: Write: Data to be output to the output-configured IOs, Read: Data seen at the IOs, independent of the direction configured.. */
#define DRV_SX1509_DATA_PIN10_Pos  (10)                               /*!< The position of the field. */
#define DRV_SX1509_DATA_PIN10_Msk  (0x1 << DRV_SX1509_DATA_PIN10_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DATA_PIN10_Low  (0)                                /*!< IO is logical low. */
#define DRV_SX1509_DATA_PIN10_High (1)                                /*!< IO is logical high. */


/* Field PIN9: Write: Data to be output to the output-configured IOs, Read: Data seen at the IOs, independent of the direction configured.. */
#define DRV_SX1509_DATA_PIN9_Pos  (9)                               /*!< The position of the field. */
#define DRV_SX1509_DATA_PIN9_Msk  (0x1 << DRV_SX1509_DATA_PIN9_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DATA_PIN9_Low  (0)                               /*!< IO is logical low. */
#define DRV_SX1509_DATA_PIN9_High (1)                               /*!< IO is logical high. */


/* Field PIN8: Write: Data to be output to the output-configured IOs, Read: Data seen at the IOs, independent of the direction configured.. */
#define DRV_SX1509_DATA_PIN8_Pos  (8)                               /*!< The position of the field. */
#define DRV_SX1509_DATA_PIN8_Msk  (0x1 << DRV_SX1509_DATA_PIN8_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DATA_PIN8_Low  (0)                               /*!< IO is logical low. */
#define DRV_SX1509_DATA_PIN8_High (1)                               /*!< IO is logical high. */


/* Field PIN7: Write: Data to be output to the output-configured IOs, Read: Data seen at the IOs, independent of the direction configured.. */
#define DRV_SX1509_DATA_PIN7_Pos  (7)                               /*!< The position of the field. */
#define DRV_SX1509_DATA_PIN7_Msk  (0x1 << DRV_SX1509_DATA_PIN7_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DATA_PIN7_Low  (0)                               /*!< IO is logical low. */
#define DRV_SX1509_DATA_PIN7_High (1)                               /*!< IO is logical high. */


/* Field PIN6: Write: Data to be output to the output-configured IOs, Read: Data seen at the IOs, independent of the direction configured.. */
#define DRV_SX1509_DATA_PIN6_Pos  (6)                               /*!< The position of the field. */
#define DRV_SX1509_DATA_PIN6_Msk  (0x1 << DRV_SX1509_DATA_PIN6_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DATA_PIN6_Low  (0)                               /*!< IO is logical low. */
#define DRV_SX1509_DATA_PIN6_High (1)                               /*!< IO is logical high. */


/* Field PIN5: Write: Data to be output to the output-configured IOs, Read: Data seen at the IOs, independent of the direction configured.. */
#define DRV_SX1509_DATA_PIN5_Pos  (5)                               /*!< The position of the field. */
#define DRV_SX1509_DATA_PIN5_Msk  (0x1 << DRV_SX1509_DATA_PIN5_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DATA_PIN5_Low  (0)                               /*!< IO is logical low. */
#define DRV_SX1509_DATA_PIN5_High (1)                               /*!< IO is logical high. */


/* Field PIN4: Write: Data to be output to the output-configured IOs, Read: Data seen at the IOs, independent of the direction configured.. */
#define DRV_SX1509_DATA_PIN4_Pos  (4)                               /*!< The position of the field. */
#define DRV_SX1509_DATA_PIN4_Msk  (0x1 << DRV_SX1509_DATA_PIN4_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DATA_PIN4_Low  (0)                               /*!< IO is logical low. */
#define DRV_SX1509_DATA_PIN4_High (1)                               /*!< IO is logical high. */


/* Field PIN3: Write: Data to be output to the output-configured IOs, Read: Data seen at the IOs, independent of the direction configured.. */
#define DRV_SX1509_DATA_PIN3_Pos  (3)                               /*!< The position of the field. */
#define DRV_SX1509_DATA_PIN3_Msk  (0x1 << DRV_SX1509_DATA_PIN3_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DATA_PIN3_Low  (0)                               /*!< IO is logical low. */
#define DRV_SX1509_DATA_PIN3_High (1)                               /*!< IO is logical high. */


/* Field PIN2: Write: Data to be output to the output-configured IOs, Read: Data seen at the IOs, independent of the direction configured.. */
#define DRV_SX1509_DATA_PIN2_Pos  (2)                               /*!< The position of the field. */
#define DRV_SX1509_DATA_PIN2_Msk  (0x1 << DRV_SX1509_DATA_PIN2_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DATA_PIN2_Low  (0)                               /*!< IO is logical low. */
#define DRV_SX1509_DATA_PIN2_High (1)                               /*!< IO is logical high. */


/* Field PIN1: Write: Data to be output to the output-configured IOs, Read: Data seen at the IOs, independent of the direction configured.. */
#define DRV_SX1509_DATA_PIN1_Pos  (1)                               /*!< The position of the field. */
#define DRV_SX1509_DATA_PIN1_Msk  (0x1 << DRV_SX1509_DATA_PIN1_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DATA_PIN1_Low  (0)                               /*!< IO is logical low. */
#define DRV_SX1509_DATA_PIN1_High (1)                               /*!< IO is logical high. */


/* Field PIN0: Write: Data to be output to the output-configured IOs, Read: Data seen at the IOs, independent of the direction configured.. */
#define DRV_SX1509_DATA_PIN0_Pos  (0)                               /*!< The position of the field. */
#define DRV_SX1509_DATA_PIN0_Msk  (0x1 << DRV_SX1509_DATA_PIN0_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DATA_PIN0_Low  (0)                               /*!< IO is logical low. */
#define DRV_SX1509_DATA_PIN0_High (1)                               /*!< IO is logical high. */


/* Register: INTERRUPTMASK. */
/* Description: Configures which [input-configured] IO will triggeran interrupt on NINT pin. */


/* Field PIN15: Configures which [input-configured] IO will triggeran interrupt on NINT pin. */
#define DRV_SX1509_INTERRUPTMASK_PIN15_Pos      (15)                                        /*!< The position of the field. */
#define DRV_SX1509_INTERRUPTMASK_PIN15_Msk      (0x1 << DRV_SX1509_INTERRUPTMASK_PIN15_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INTERRUPTMASK_PIN15_Unmasked (0)                                         /*!< An event on this IO will trigger an interrupt. */
#define DRV_SX1509_INTERRUPTMASK_PIN15_Masked   (1)                                         /*!< An event on this IO will NOT trigger an interrupt. */


