NordicPlayground/nrf528xx-ble-throughput-demo/display_shield_files/inc/drv_sx1509_bitfields.h
/* Field PIN14: Configures which [input-configured] IO will triggeran interrupt on NINT pin. */
#define DRV_SX1509_INTERRUPTMASK_PIN14_Pos      (14)                                        /*!< The position of the field. */
#define DRV_SX1509_INTERRUPTMASK_PIN14_Msk      (0x1 << DRV_SX1509_INTERRUPTMASK_PIN14_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INTERRUPTMASK_PIN14_Unmasked (0)                                         /*!< An event on this IO will trigger an interrupt. */
#define DRV_SX1509_INTERRUPTMASK_PIN14_Masked   (1)                                         /*!< An event on this IO will NOT trigger an interrupt. */


/* Field PIN13: Configures which [input-configured] IO will triggeran interrupt on NINT pin. */
#define DRV_SX1509_INTERRUPTMASK_PIN13_Pos      (13)                                        /*!< The position of the field. */
#define DRV_SX1509_INTERRUPTMASK_PIN13_Msk      (0x1 << DRV_SX1509_INTERRUPTMASK_PIN13_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INTERRUPTMASK_PIN13_Unmasked (0)                                         /*!< An event on this IO will trigger an interrupt. */
#define DRV_SX1509_INTERRUPTMASK_PIN13_Masked   (1)                                         /*!< An event on this IO will NOT trigger an interrupt. */


/* Field PIN12: Configures which [input-configured] IO will triggeran interrupt on NINT pin. */
#define DRV_SX1509_INTERRUPTMASK_PIN12_Pos      (12)                                        /*!< The position of the field. */
#define DRV_SX1509_INTERRUPTMASK_PIN12_Msk      (0x1 << DRV_SX1509_INTERRUPTMASK_PIN12_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INTERRUPTMASK_PIN12_Unmasked (0)                                         /*!< An event on this IO will trigger an interrupt. */
#define DRV_SX1509_INTERRUPTMASK_PIN12_Masked   (1)                                         /*!< An event on this IO will NOT trigger an interrupt. */


/* Field PIN11: Configures which [input-configured] IO will triggeran interrupt on NINT pin. */
#define DRV_SX1509_INTERRUPTMASK_PIN11_Pos      (11)                                        /*!< The position of the field. */
#define DRV_SX1509_INTERRUPTMASK_PIN11_Msk      (0x1 << DRV_SX1509_INTERRUPTMASK_PIN11_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INTERRUPTMASK_PIN11_Unmasked (0)                                         /*!< An event on this IO will trigger an interrupt. */
#define DRV_SX1509_INTERRUPTMASK_PIN11_Masked   (1)                                         /*!< An event on this IO will NOT trigger an interrupt. */


/* Field PIN10: Configures which [input-configured] IO will triggeran interrupt on NINT pin. */
#define DRV_SX1509_INTERRUPTMASK_PIN10_Pos      (10)                                        /*!< The position of the field. */
#define DRV_SX1509_INTERRUPTMASK_PIN10_Msk      (0x1 << DRV_SX1509_INTERRUPTMASK_PIN10_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INTERRUPTMASK_PIN10_Unmasked (0)                                         /*!< An event on this IO will trigger an interrupt. */
#define DRV_SX1509_INTERRUPTMASK_PIN10_Masked   (1)                                         /*!< An event on this IO will NOT trigger an interrupt. */


/* Field PIN9: Configures which [input-configured] IO will triggeran interrupt on NINT pin. */
#define DRV_SX1509_INTERRUPTMASK_PIN9_Pos      (9)                                        /*!< The position of the field. */
#define DRV_SX1509_INTERRUPTMASK_PIN9_Msk      (0x1 << DRV_SX1509_INTERRUPTMASK_PIN9_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INTERRUPTMASK_PIN9_Unmasked (0)                                        /*!< An event on this IO will trigger an interrupt. */
#define DRV_SX1509_INTERRUPTMASK_PIN9_Masked   (1)                                        /*!< An event on this IO will NOT trigger an interrupt. */


/* Field PIN8: Configures which [input-configured] IO will triggeran interrupt on NINT pin. */
#define DRV_SX1509_INTERRUPTMASK_PIN8_Pos      (8)                                        /*!< The position of the field. */
#define DRV_SX1509_INTERRUPTMASK_PIN8_Msk      (0x1 << DRV_SX1509_INTERRUPTMASK_PIN8_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INTERRUPTMASK_PIN8_Unmasked (0)                                        /*!< An event on this IO will trigger an interrupt. */
#define DRV_SX1509_INTERRUPTMASK_PIN8_Masked   (1)                                        /*!< An event on this IO will NOT trigger an interrupt. */


/* Field PIN7: Configures which [input-configured] IO will triggeran interrupt on NINT pin. */
#define DRV_SX1509_INTERRUPTMASK_PIN7_Pos      (7)                                        /*!< The position of the field. */
#define DRV_SX1509_INTERRUPTMASK_PIN7_Msk      (0x1 << DRV_SX1509_INTERRUPTMASK_PIN7_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INTERRUPTMASK_PIN7_Unmasked (0)                                        /*!< An event on this IO will trigger an interrupt. */
#define DRV_SX1509_INTERRUPTMASK_PIN7_Masked   (1)                                        /*!< An event on this IO will NOT trigger an interrupt. */


/* Field PIN6: Configures which [input-configured] IO will triggeran interrupt on NINT pin. */
#define DRV_SX1509_INTERRUPTMASK_PIN6_Pos      (6)                                        /*!< The position of the field. */
#define DRV_SX1509_INTERRUPTMASK_PIN6_Msk      (0x1 << DRV_SX1509_INTERRUPTMASK_PIN6_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INTERRUPTMASK_PIN6_Unmasked (0)                                        /*!< An event on this IO will trigger an interrupt. */
#define DRV_SX1509_INTERRUPTMASK_PIN6_Masked   (1)                                        /*!< An event on this IO will NOT trigger an interrupt. */


/* Field PIN5: Configures which [input-configured] IO will triggeran interrupt on NINT pin. */
#define DRV_SX1509_INTERRUPTMASK_PIN5_Pos      (5)                                        /*!< The position of the field. */
#define DRV_SX1509_INTERRUPTMASK_PIN5_Msk      (0x1 << DRV_SX1509_INTERRUPTMASK_PIN5_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INTERRUPTMASK_PIN5_Unmasked (0)                                        /*!< An event on this IO will trigger an interrupt. */
#define DRV_SX1509_INTERRUPTMASK_PIN5_Masked   (1)                                        /*!< An event on this IO will NOT trigger an interrupt. */


