NordicPlayground/nrf528xx-ble-throughput-demo/display_shield_files/inc/drv_sx1509_bitfields.h
/* Field PIN4: Configures which [input-configured] IO will triggeran interrupt on NINT pin. */
#define DRV_SX1509_INTERRUPTMASK_PIN4_Pos      (4)                                        /*!< The position of the field. */
#define DRV_SX1509_INTERRUPTMASK_PIN4_Msk      (0x1 << DRV_SX1509_INTERRUPTMASK_PIN4_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INTERRUPTMASK_PIN4_Unmasked (0)                                        /*!< An event on this IO will trigger an interrupt. */
#define DRV_SX1509_INTERRUPTMASK_PIN4_Masked   (1)                                        /*!< An event on this IO will NOT trigger an interrupt. */


/* Field PIN3: Configures which [input-configured] IO will triggeran interrupt on NINT pin. */
#define DRV_SX1509_INTERRUPTMASK_PIN3_Pos      (3)                                        /*!< The position of the field. */
#define DRV_SX1509_INTERRUPTMASK_PIN3_Msk      (0x1 << DRV_SX1509_INTERRUPTMASK_PIN3_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INTERRUPTMASK_PIN3_Unmasked (0)                                        /*!< An event on this IO will trigger an interrupt. */
#define DRV_SX1509_INTERRUPTMASK_PIN3_Masked   (1)                                        /*!< An event on this IO will NOT trigger an interrupt. */


/* Field PIN2: Configures which [input-configured] IO will triggeran interrupt on NINT pin. */
#define DRV_SX1509_INTERRUPTMASK_PIN2_Pos      (2)                                        /*!< The position of the field. */
#define DRV_SX1509_INTERRUPTMASK_PIN2_Msk      (0x1 << DRV_SX1509_INTERRUPTMASK_PIN2_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INTERRUPTMASK_PIN2_Unmasked (0)                                        /*!< An event on this IO will trigger an interrupt. */
#define DRV_SX1509_INTERRUPTMASK_PIN2_Masked   (1)                                        /*!< An event on this IO will NOT trigger an interrupt. */


/* Field PIN1: Configures which [input-configured] IO will triggeran interrupt on NINT pin. */
#define DRV_SX1509_INTERRUPTMASK_PIN1_Pos      (1)                                        /*!< The position of the field. */
#define DRV_SX1509_INTERRUPTMASK_PIN1_Msk      (0x1 << DRV_SX1509_INTERRUPTMASK_PIN1_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INTERRUPTMASK_PIN1_Unmasked (0)                                        /*!< An event on this IO will trigger an interrupt. */
#define DRV_SX1509_INTERRUPTMASK_PIN1_Masked   (1)                                        /*!< An event on this IO will NOT trigger an interrupt. */


/* Field PIN0: Configures which [input-configured] IO will triggeran interrupt on NINT pin. */
#define DRV_SX1509_INTERRUPTMASK_PIN0_Pos      (0)                                        /*!< The position of the field. */
#define DRV_SX1509_INTERRUPTMASK_PIN0_Msk      (0x1 << DRV_SX1509_INTERRUPTMASK_PIN0_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INTERRUPTMASK_PIN0_Unmasked (0)                                        /*!< An event on this IO will trigger an interrupt. */
#define DRV_SX1509_INTERRUPTMASK_PIN0_Masked   (1)                                        /*!< An event on this IO will NOT trigger an interrupt. */


/* Register: SENSE. */
/* Description: Configures edge sensitivity. */


/* Field HIGH15: Configures the edge sensitivity of the corresponting RegData[n]. */
#define DRV_SX1509_SENSE_HIGH15_Pos     (30)                                 /*!< The position of the field. */
#define DRV_SX1509_SENSE_HIGH15_Msk     (0x3 << DRV_SX1509_SENSE_HIGH15_Pos) /*!< The mask of the field. */
#define DRV_SX1509_SENSE_HIGH15_None    (0)                                  /*!< No edge sensitivity configured. */
#define DRV_SX1509_SENSE_HIGH15_Rising  (1)                                  /*!< Sensitive to rising edge. */
#define DRV_SX1509_SENSE_HIGH15_Falling (2)                                  /*!< Sensitive to falling edge. */
#define DRV_SX1509_SENSE_HIGH15_Both    (3)                                  /*!< Sensitive to both edges. */


/* Field HIGH14: Configures the edge sensitivity of the corresponting RegData[n]. */
#define DRV_SX1509_SENSE_HIGH14_Pos     (28)                                 /*!< The position of the field. */
#define DRV_SX1509_SENSE_HIGH14_Msk     (0x3 << DRV_SX1509_SENSE_HIGH14_Pos) /*!< The mask of the field. */
#define DRV_SX1509_SENSE_HIGH14_None    (0)                                  /*!< No edge sensitivity configured. */
#define DRV_SX1509_SENSE_HIGH14_Rising  (1)                                  /*!< Sensitive to rising edge. */
#define DRV_SX1509_SENSE_HIGH14_Falling (2)                                  /*!< Sensitive to falling edge. */
#define DRV_SX1509_SENSE_HIGH14_Both    (3)                                  /*!< Sensitive to both edges. */


/* Field HIGH13: Configures the edge sensitivity of the corresponting RegData[n]. */
#define DRV_SX1509_SENSE_HIGH13_Pos     (26)                                 /*!< The position of the field. */
#define DRV_SX1509_SENSE_HIGH13_Msk     (0x3 << DRV_SX1509_SENSE_HIGH13_Pos) /*!< The mask of the field. */
#define DRV_SX1509_SENSE_HIGH13_None    (0)                                  /*!< No edge sensitivity configured. */
#define DRV_SX1509_SENSE_HIGH13_Rising  (1)                                  /*!< Sensitive to rising edge. */
#define DRV_SX1509_SENSE_HIGH13_Falling (2)                                  /*!< Sensitive to falling edge. */
#define DRV_SX1509_SENSE_HIGH13_Both    (3)                                  /*!< Sensitive to both edges. */


/* Field HIGH12: Configures the edge sensitivity of the corresponting RegData[n]. */
#define DRV_SX1509_SENSE_HIGH12_Pos     (24)                                 /*!< The position of the field. */
#define DRV_SX1509_SENSE_HIGH12_Msk     (0x3 << DRV_SX1509_SENSE_HIGH12_Pos) /*!< The mask of the field. */
#define DRV_SX1509_SENSE_HIGH12_None    (0)                                  /*!< No edge sensitivity configured. */
#define DRV_SX1509_SENSE_HIGH12_Rising  (1)                                  /*!< Sensitive to rising edge. */
#define DRV_SX1509_SENSE_HIGH12_Falling (2)                                  /*!< Sensitive to falling edge. */
#define DRV_SX1509_SENSE_HIGH12_Both    (3)                                  /*!< Sensitive to both edges. */


/* Field LOW11: Configures the edge sensitivity of the corresponting RegData[n]. */
#define DRV_SX1509_SENSE_LOW11_Pos     (22)                                /*!< The position of the field. */
#define DRV_SX1509_SENSE_LOW11_Msk     (0x3 << DRV_SX1509_SENSE_LOW11_Pos) /*!< The mask of the field. */
#define DRV_SX1509_SENSE_LOW11_None    (0)                                 /*!< No edge sensitivity configured. */
#define DRV_SX1509_SENSE_LOW11_Rising  (1)                                 /*!< Sensitive to rising edge. */
#define DRV_SX1509_SENSE_LOW11_Falling (2)                                 /*!< Sensitive to falling edge. */
#define DRV_SX1509_SENSE_LOW11_Both    (3)                                 /*!< Sensitive to both edges. */


