NordicPlayground/nrf528xx-ble-throughput-demo/display_shield_files/inc/drv_sx1509_bitfields.h
/* Field LOW10: Configures the edge sensitivity of the corresponting RegData[n]. */
#define DRV_SX1509_SENSE_LOW10_Pos     (20)                                /*!< The position of the field. */
#define DRV_SX1509_SENSE_LOW10_Msk     (0x3 << DRV_SX1509_SENSE_LOW10_Pos) /*!< The mask of the field. */
#define DRV_SX1509_SENSE_LOW10_None    (0)                                 /*!< No edge sensitivity configured. */
#define DRV_SX1509_SENSE_LOW10_Rising  (1)                                 /*!< Sensitive to rising edge. */
#define DRV_SX1509_SENSE_LOW10_Falling (2)                                 /*!< Sensitive to falling edge. */
#define DRV_SX1509_SENSE_LOW10_Both    (3)                                 /*!< Sensitive to both edges. */


/* Field LOW9: Configures the edge sensitivity of the corresponting RegData[n]. */
#define DRV_SX1509_SENSE_LOW9_Pos     (18)                               /*!< The position of the field. */
#define DRV_SX1509_SENSE_LOW9_Msk     (0x3 << DRV_SX1509_SENSE_LOW9_Pos) /*!< The mask of the field. */
#define DRV_SX1509_SENSE_LOW9_None    (0)                                /*!< No edge sensitivity configured. */
#define DRV_SX1509_SENSE_LOW9_Rising  (1)                                /*!< Sensitive to rising edge. */
#define DRV_SX1509_SENSE_LOW9_Falling (2)                                /*!< Sensitive to falling edge. */
#define DRV_SX1509_SENSE_LOW9_Both    (3)                                /*!< Sensitive to both edges. */


/* Field LOW8: Configures the edge sensitivity of the corresponting RegData[n]. */
#define DRV_SX1509_SENSE_LOW8_Pos     (16)                               /*!< The position of the field. */
#define DRV_SX1509_SENSE_LOW8_Msk     (0x3 << DRV_SX1509_SENSE_LOW8_Pos) /*!< The mask of the field. */
#define DRV_SX1509_SENSE_LOW8_None    (0)                                /*!< No edge sensitivity configured. */
#define DRV_SX1509_SENSE_LOW8_Rising  (1)                                /*!< Sensitive to rising edge. */
#define DRV_SX1509_SENSE_LOW8_Falling (2)                                /*!< Sensitive to falling edge. */
#define DRV_SX1509_SENSE_LOW8_Both    (3)                                /*!< Sensitive to both edges. */


/* Field HIGH7: Configures the edge sensitivity of the corresponting RegData[n]. */
#define DRV_SX1509_SENSE_HIGH7_Pos     (14)                                /*!< The position of the field. */
#define DRV_SX1509_SENSE_HIGH7_Msk     (0x3 << DRV_SX1509_SENSE_HIGH7_Pos) /*!< The mask of the field. */
#define DRV_SX1509_SENSE_HIGH7_None    (0)                                 /*!< No edge sensitivity configured. */
#define DRV_SX1509_SENSE_HIGH7_Rising  (1)                                 /*!< Sensitive to rising edge. */
#define DRV_SX1509_SENSE_HIGH7_Falling (2)                                 /*!< Sensitive to falling edge. */
#define DRV_SX1509_SENSE_HIGH7_Both    (3)                                 /*!< Sensitive to both edges. */


/* Field HIGH6: Configures the edge sensitivity of the corresponting RegData[n]. */
#define DRV_SX1509_SENSE_HIGH6_Pos     (12)                                /*!< The position of the field. */
#define DRV_SX1509_SENSE_HIGH6_Msk     (0x3 << DRV_SX1509_SENSE_HIGH6_Pos) /*!< The mask of the field. */
#define DRV_SX1509_SENSE_HIGH6_None    (0)                                 /*!< No edge sensitivity configured. */
#define DRV_SX1509_SENSE_HIGH6_Rising  (1)                                 /*!< Sensitive to rising edge. */
#define DRV_SX1509_SENSE_HIGH6_Falling (2)                                 /*!< Sensitive to falling edge. */
#define DRV_SX1509_SENSE_HIGH6_Both    (3)                                 /*!< Sensitive to both edges. */


/* Field HIGH5: Configures the edge sensitivity of the corresponting RegData[n]. */
#define DRV_SX1509_SENSE_HIGH5_Pos     (10)                                /*!< The position of the field. */
#define DRV_SX1509_SENSE_HIGH5_Msk     (0x3 << DRV_SX1509_SENSE_HIGH5_Pos) /*!< The mask of the field. */
#define DRV_SX1509_SENSE_HIGH5_None    (0)                                 /*!< No edge sensitivity configured. */
#define DRV_SX1509_SENSE_HIGH5_Rising  (1)                                 /*!< Sensitive to rising edge. */
#define DRV_SX1509_SENSE_HIGH5_Falling (2)                                 /*!< Sensitive to falling edge. */
#define DRV_SX1509_SENSE_HIGH5_Both    (3)                                 /*!< Sensitive to both edges. */


/* Field HIGH4: Configures the edge sensitivity of the corresponting RegData[n]. */
#define DRV_SX1509_SENSE_HIGH4_Pos     (8)                                 /*!< The position of the field. */
#define DRV_SX1509_SENSE_HIGH4_Msk     (0x3 << DRV_SX1509_SENSE_HIGH4_Pos) /*!< The mask of the field. */
#define DRV_SX1509_SENSE_HIGH4_None    (0)                                 /*!< No edge sensitivity configured. */
#define DRV_SX1509_SENSE_HIGH4_Rising  (1)                                 /*!< Sensitive to rising edge. */
#define DRV_SX1509_SENSE_HIGH4_Falling (2)                                 /*!< Sensitive to falling edge. */
#define DRV_SX1509_SENSE_HIGH4_Both    (3)                                 /*!< Sensitive to both edges. */


/* Field LOW3: Configures the edge sensitivity of the corresponting RegData[n]. */
#define DRV_SX1509_SENSE_LOW3_Pos     (6)                                /*!< The position of the field. */
#define DRV_SX1509_SENSE_LOW3_Msk     (0x3 << DRV_SX1509_SENSE_LOW3_Pos) /*!< The mask of the field. */
#define DRV_SX1509_SENSE_LOW3_None    (0)                                /*!< No edge sensitivity configured. */
#define DRV_SX1509_SENSE_LOW3_Rising  (1)                                /*!< Sensitive to rising edge. */
#define DRV_SX1509_SENSE_LOW3_Falling (2)                                /*!< Sensitive to falling edge. */
#define DRV_SX1509_SENSE_LOW3_Both    (3)                                /*!< Sensitive to both edges. */


/* Field LOW2: Configures the edge sensitivity of the corresponting RegData[n]. */
#define DRV_SX1509_SENSE_LOW2_Pos     (4)                                /*!< The position of the field. */
#define DRV_SX1509_SENSE_LOW2_Msk     (0x3 << DRV_SX1509_SENSE_LOW2_Pos) /*!< The mask of the field. */
#define DRV_SX1509_SENSE_LOW2_None    (0)                                /*!< No edge sensitivity configured. */
#define DRV_SX1509_SENSE_LOW2_Rising  (1)                                /*!< Sensitive to rising edge. */
#define DRV_SX1509_SENSE_LOW2_Falling (2)                                /*!< Sensitive to falling edge. */
#define DRV_SX1509_SENSE_LOW2_Both    (3)                                /*!< Sensitive to both edges. */


/* Field LOW1: Configures the edge sensitivity of the corresponting RegData[n]. */
#define DRV_SX1509_SENSE_LOW1_Pos     (2)                                /*!< The position of the field. */
#define DRV_SX1509_SENSE_LOW1_Msk     (0x3 << DRV_SX1509_SENSE_LOW1_Pos) /*!< The mask of the field. */
#define DRV_SX1509_SENSE_LOW1_None    (0)                                /*!< No edge sensitivity configured. */
#define DRV_SX1509_SENSE_LOW1_Rising  (1)                                /*!< Sensitive to rising edge. */
#define DRV_SX1509_SENSE_LOW1_Falling (2)                                /*!< Sensitive to falling edge. */
#define DRV_SX1509_SENSE_LOW1_Both    (3)                                /*!< Sensitive to both edges. */


