NordicPlayground/nrf528xx-ble-throughput-demo/display_shield_files/inc/drv_sx1509_bitfields.h
/* Field LOW0: Configures the edge sensitivity of the corresponting RegData[n]. */
#define DRV_SX1509_SENSE_LOW0_Pos     (0)                                /*!< The position of the field. */
#define DRV_SX1509_SENSE_LOW0_Msk     (0x3 << DRV_SX1509_SENSE_LOW0_Pos) /*!< The mask of the field. */
#define DRV_SX1509_SENSE_LOW0_None    (0)                                /*!< No edge sensitivity configured. */
#define DRV_SX1509_SENSE_LOW0_Rising  (1)                                /*!< Sensitive to rising edge. */
#define DRV_SX1509_SENSE_LOW0_Falling (2)                                /*!< Sensitive to falling edge. */
#define DRV_SX1509_SENSE_LOW0_Both    (3)                                /*!< Sensitive to both edges. */


/* Register: INTERRUPTSOURCE. */
/* Description: Interrupt source register - I/O. */


/* Field PIN15: Interrupt source (from IOs set in RegInterruptMask). */
#define DRV_SX1509_INTERRUPTSOURCE_PIN15_Pos       (15)                                          /*!< The position of the field. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN15_Msk       (0x1 << DRV_SX1509_INTERRUPTSOURCE_PIN15_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN15_None      (0)                                           /*!< No interrupt has been triggered by this IO. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN15_Triggered (1)                                           /*!< An interrupt has been triggered by this IO (an event as configured in relevant RegSense register occured).. */


/* Field PIN14: Interrupt source (from IOs set in RegInterruptMask). */
#define DRV_SX1509_INTERRUPTSOURCE_PIN14_Pos       (14)                                          /*!< The position of the field. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN14_Msk       (0x1 << DRV_SX1509_INTERRUPTSOURCE_PIN14_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN14_None      (0)                                           /*!< No interrupt has been triggered by this IO. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN14_Triggered (1)                                           /*!< An interrupt has been triggered by this IO (an event as configured in relevant RegSense register occured).. */


/* Field PIN13: Interrupt source (from IOs set in RegInterruptMask). */
#define DRV_SX1509_INTERRUPTSOURCE_PIN13_Pos       (13)                                          /*!< The position of the field. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN13_Msk       (0x1 << DRV_SX1509_INTERRUPTSOURCE_PIN13_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN13_None      (0)                                           /*!< No interrupt has been triggered by this IO. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN13_Triggered (1)                                           /*!< An interrupt has been triggered by this IO (an event as configured in relevant RegSense register occured).. */


/* Field PIN12: Interrupt source (from IOs set in RegInterruptMask). */
#define DRV_SX1509_INTERRUPTSOURCE_PIN12_Pos       (12)                                          /*!< The position of the field. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN12_Msk       (0x1 << DRV_SX1509_INTERRUPTSOURCE_PIN12_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN12_None      (0)                                           /*!< No interrupt has been triggered by this IO. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN12_Triggered (1)                                           /*!< An interrupt has been triggered by this IO (an event as configured in relevant RegSense register occured).. */


/* Field PIN11: Interrupt source (from IOs set in RegInterruptMask). */
#define DRV_SX1509_INTERRUPTSOURCE_PIN11_Pos       (11)                                          /*!< The position of the field. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN11_Msk       (0x1 << DRV_SX1509_INTERRUPTSOURCE_PIN11_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN11_None      (0)                                           /*!< No interrupt has been triggered by this IO. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN11_Triggered (1)                                           /*!< An interrupt has been triggered by this IO (an event as configured in relevant RegSense register occured).. */


/* Field PIN10: Interrupt source (from IOs set in RegInterruptMask). */
#define DRV_SX1509_INTERRUPTSOURCE_PIN10_Pos       (10)                                          /*!< The position of the field. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN10_Msk       (0x1 << DRV_SX1509_INTERRUPTSOURCE_PIN10_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN10_None      (0)                                           /*!< No interrupt has been triggered by this IO. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN10_Triggered (1)                                           /*!< An interrupt has been triggered by this IO (an event as configured in relevant RegSense register occured).. */


/* Field PIN9: Interrupt source (from IOs set in RegInterruptMask). */
#define DRV_SX1509_INTERRUPTSOURCE_PIN9_Pos       (9)                                          /*!< The position of the field. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN9_Msk       (0x1 << DRV_SX1509_INTERRUPTSOURCE_PIN9_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN9_None      (0)                                          /*!< No interrupt has been triggered by this IO. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN9_Triggered (1)                                          /*!< An interrupt has been triggered by this IO (an event as configured in relevant RegSense register occured).. */


/* Field PIN8: Interrupt source (from IOs set in RegInterruptMask). */
#define DRV_SX1509_INTERRUPTSOURCE_PIN8_Pos       (8)                                          /*!< The position of the field. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN8_Msk       (0x1 << DRV_SX1509_INTERRUPTSOURCE_PIN8_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN8_None      (0)                                          /*!< No interrupt has been triggered by this IO. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN8_Triggered (1)                                          /*!< An interrupt has been triggered by this IO (an event as configured in relevant RegSense register occured).. */


