NordicPlayground/nrf528xx-ble-throughput-demo/display_shield_files/inc/drv_sx1509_bitfields.h
/* Field PIN7: Interrupt source (from IOs set in RegInterruptMask). */
#define DRV_SX1509_INTERRUPTSOURCE_PIN7_Pos       (7)                                          /*!< The position of the field. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN7_Msk       (0x1 << DRV_SX1509_INTERRUPTSOURCE_PIN7_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN7_None      (0)                                          /*!< No interrupt has been triggered by this IO. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN7_Triggered (1)                                          /*!< An interrupt has been triggered by this IO (an event as configured in relevant RegSense register occured).. */


/* Field PIN6: Interrupt source (from IOs set in RegInterruptMask). */
#define DRV_SX1509_INTERRUPTSOURCE_PIN6_Pos       (6)                                          /*!< The position of the field. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN6_Msk       (0x1 << DRV_SX1509_INTERRUPTSOURCE_PIN6_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN6_None      (0)                                          /*!< No interrupt has been triggered by this IO. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN6_Triggered (1)                                          /*!< An interrupt has been triggered by this IO (an event as configured in relevant RegSense register occured).. */


/* Field PIN5: Interrupt source (from IOs set in RegInterruptMask). */
#define DRV_SX1509_INTERRUPTSOURCE_PIN5_Pos       (5)                                          /*!< The position of the field. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN5_Msk       (0x1 << DRV_SX1509_INTERRUPTSOURCE_PIN5_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN5_None      (0)                                          /*!< No interrupt has been triggered by this IO. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN5_Triggered (1)                                          /*!< An interrupt has been triggered by this IO (an event as configured in relevant RegSense register occured).. */


/* Field PIN4: Interrupt source (from IOs set in RegInterruptMask). */
#define DRV_SX1509_INTERRUPTSOURCE_PIN4_Pos       (4)                                          /*!< The position of the field. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN4_Msk       (0x1 << DRV_SX1509_INTERRUPTSOURCE_PIN4_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN4_None      (0)                                          /*!< No interrupt has been triggered by this IO. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN4_Triggered (1)                                          /*!< An interrupt has been triggered by this IO (an event as configured in relevant RegSense register occured).. */


/* Field PIN3: Interrupt source (from IOs set in RegInterruptMask). */
#define DRV_SX1509_INTERRUPTSOURCE_PIN3_Pos       (3)                                          /*!< The position of the field. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN3_Msk       (0x1 << DRV_SX1509_INTERRUPTSOURCE_PIN3_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN3_None      (0)                                          /*!< No interrupt has been triggered by this IO. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN3_Triggered (1)                                          /*!< An interrupt has been triggered by this IO (an event as configured in relevant RegSense register occured).. */


/* Field PIN2: Interrupt source (from IOs set in RegInterruptMask). */
#define DRV_SX1509_INTERRUPTSOURCE_PIN2_Pos       (2)                                          /*!< The position of the field. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN2_Msk       (0x1 << DRV_SX1509_INTERRUPTSOURCE_PIN2_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN2_None      (0)                                          /*!< No interrupt has been triggered by this IO. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN2_Triggered (1)                                          /*!< An interrupt has been triggered by this IO (an event as configured in relevant RegSense register occured).. */


/* Field PIN1: Interrupt source (from IOs set in RegInterruptMask). */
#define DRV_SX1509_INTERRUPTSOURCE_PIN1_Pos       (1)                                          /*!< The position of the field. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN1_Msk       (0x1 << DRV_SX1509_INTERRUPTSOURCE_PIN1_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN1_None      (0)                                          /*!< No interrupt has been triggered by this IO. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN1_Triggered (1)                                          /*!< An interrupt has been triggered by this IO (an event as configured in relevant RegSense register occured).. */


/* Field PIN0: Interrupt source (from IOs set in RegInterruptMask). */
#define DRV_SX1509_INTERRUPTSOURCE_PIN0_Pos       (0)                                          /*!< The position of the field. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN0_Msk       (0x1 << DRV_SX1509_INTERRUPTSOURCE_PIN0_Pos) /*!< The mask of the field. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN0_None      (0)                                          /*!< No interrupt has been triggered by this IO. */
#define DRV_SX1509_INTERRUPTSOURCE_PIN0_Triggered (1)                                          /*!< An interrupt has been triggered by this IO (an event as configured in relevant RegSense register occured).. */


/* Register: EVENTSTATUS. */
/* Description: Event status register - I/O. */


/* Field PIN15: Interrupt source (from IOs set in RegInterruptMask). */
#define DRV_SX1509_EVENTSTATUS_PIN15_Pos       (15)                                      /*!< The position of the field. */
#define DRV_SX1509_EVENTSTATUS_PIN15_Msk       (0x1 << DRV_SX1509_EVENTSTATUS_PIN15_Pos) /*!< The mask of the field. */
#define DRV_SX1509_EVENTSTATUS_PIN15_None      (0)                                       /*!< No event has occured on this IO. */
#define DRV_SX1509_EVENTSTATUS_PIN15_Triggered (1)                                       /*!< An event has occured on this IO (an edge as configured in relevant RegSense register occured). */


/* Field PIN14: Interrupt source (from IOs set in RegInterruptMask). */
#define DRV_SX1509_EVENTSTATUS_PIN14_Pos       (14)                                      /*!< The position of the field. */
#define DRV_SX1509_EVENTSTATUS_PIN14_Msk       (0x1 << DRV_SX1509_EVENTSTATUS_PIN14_Pos) /*!< The mask of the field. */
#define DRV_SX1509_EVENTSTATUS_PIN14_None      (0)                                       /*!< No event has occured on this IO. */
#define DRV_SX1509_EVENTSTATUS_PIN14_Triggered (1)                                       /*!< An event has occured on this IO (an edge as configured in relevant RegSense register occured). */


/* Field PIN13: Interrupt source (from IOs set in RegInterruptMask). */
#define DRV_SX1509_EVENTSTATUS_PIN13_Pos       (13)                                      /*!< The position of the field. */
#define DRV_SX1509_EVENTSTATUS_PIN13_Msk       (0x1 << DRV_SX1509_EVENTSTATUS_PIN13_Pos) /*!< The mask of the field. */
#define DRV_SX1509_EVENTSTATUS_PIN13_None      (0)                                       /*!< No event has occured on this IO. */
#define DRV_SX1509_EVENTSTATUS_PIN13_Triggered (1)                                       /*!< An event has occured on this IO (an edge as configured in relevant RegSense register occured). */


/* Field PIN12: Interrupt source (from IOs set in RegInterruptMask). */
#define DRV_SX1509_EVENTSTATUS_PIN12_Pos       (12)                                      /*!< The position of the field. */
#define DRV_SX1509_EVENTSTATUS_PIN12_Msk       (0x1 << DRV_SX1509_EVENTSTATUS_PIN12_Pos) /*!< The mask of the field. */
#define DRV_SX1509_EVENTSTATUS_PIN12_None      (0)                                       /*!< No event has occured on this IO. */
#define DRV_SX1509_EVENTSTATUS_PIN12_Triggered (1)                                       /*!< An event has occured on this IO (an edge as configured in relevant RegSense register occured). */


/* Field PIN11: Interrupt source (from IOs set in RegInterruptMask). */
#define DRV_SX1509_EVENTSTATUS_PIN11_Pos       (11)                                      /*!< The position of the field. */
#define DRV_SX1509_EVENTSTATUS_PIN11_Msk       (0x1 << DRV_SX1509_EVENTSTATUS_PIN11_Pos) /*!< The mask of the field. */
#define DRV_SX1509_EVENTSTATUS_PIN11_None      (0)                                       /*!< No event has occured on this IO. */
#define DRV_SX1509_EVENTSTATUS_PIN11_Triggered (1)                                       /*!< An event has occured on this IO (an edge as configured in relevant RegSense register occured). */


