NordicPlayground/nrf528xx-ble-throughput-demo/display_shield_files/inc/drv_sx1509_bitfields.h
/* Field PIN10: Interrupt source (from IOs set in RegInterruptMask). */
#define DRV_SX1509_EVENTSTATUS_PIN10_Pos       (10)                                      /*!< The position of the field. */
#define DRV_SX1509_EVENTSTATUS_PIN10_Msk       (0x1 << DRV_SX1509_EVENTSTATUS_PIN10_Pos) /*!< The mask of the field. */
#define DRV_SX1509_EVENTSTATUS_PIN10_None      (0)                                       /*!< No event has occured on this IO. */
#define DRV_SX1509_EVENTSTATUS_PIN10_Triggered (1)                                       /*!< An event has occured on this IO (an edge as configured in relevant RegSense register occured). */


/* Field PIN9: Interrupt source (from IOs set in RegInterruptMask). */
#define DRV_SX1509_EVENTSTATUS_PIN9_Pos       (9)                                      /*!< The position of the field. */
#define DRV_SX1509_EVENTSTATUS_PIN9_Msk       (0x1 << DRV_SX1509_EVENTSTATUS_PIN9_Pos) /*!< The mask of the field. */
#define DRV_SX1509_EVENTSTATUS_PIN9_None      (0)                                      /*!< No event has occured on this IO. */
#define DRV_SX1509_EVENTSTATUS_PIN9_Triggered (1)                                      /*!< An event has occured on this IO (an edge as configured in relevant RegSense register occured). */


/* Field PIN8: Interrupt source (from IOs set in RegInterruptMask). */
#define DRV_SX1509_EVENTSTATUS_PIN8_Pos       (8)                                      /*!< The position of the field. */
#define DRV_SX1509_EVENTSTATUS_PIN8_Msk       (0x1 << DRV_SX1509_EVENTSTATUS_PIN8_Pos) /*!< The mask of the field. */
#define DRV_SX1509_EVENTSTATUS_PIN8_None      (0)                                      /*!< No event has occured on this IO. */
#define DRV_SX1509_EVENTSTATUS_PIN8_Triggered (1)                                      /*!< An event has occured on this IO (an edge as configured in relevant RegSense register occured). */


/* Field PIN7: Interrupt source (from IOs set in RegInterruptMask). */
#define DRV_SX1509_EVENTSTATUS_PIN7_Pos       (7)                                      /*!< The position of the field. */
#define DRV_SX1509_EVENTSTATUS_PIN7_Msk       (0x1 << DRV_SX1509_EVENTSTATUS_PIN7_Pos) /*!< The mask of the field. */
#define DRV_SX1509_EVENTSTATUS_PIN7_None      (0)                                      /*!< No event has occured on this IO. */
#define DRV_SX1509_EVENTSTATUS_PIN7_Triggered (1)                                      /*!< An event has occured on this IO (an edge as configured in relevant RegSense register occured). */


/* Field PIN6: Interrupt source (from IOs set in RegInterruptMask). */
#define DRV_SX1509_EVENTSTATUS_PIN6_Pos       (6)                                      /*!< The position of the field. */
#define DRV_SX1509_EVENTSTATUS_PIN6_Msk       (0x1 << DRV_SX1509_EVENTSTATUS_PIN6_Pos) /*!< The mask of the field. */
#define DRV_SX1509_EVENTSTATUS_PIN6_None      (0)                                      /*!< No event has occured on this IO. */
#define DRV_SX1509_EVENTSTATUS_PIN6_Triggered (1)                                      /*!< An event has occured on this IO (an edge as configured in relevant RegSense register occured). */


/* Field PIN5: Interrupt source (from IOs set in RegInterruptMask). */
#define DRV_SX1509_EVENTSTATUS_PIN5_Pos       (5)                                      /*!< The position of the field. */
#define DRV_SX1509_EVENTSTATUS_PIN5_Msk       (0x1 << DRV_SX1509_EVENTSTATUS_PIN5_Pos) /*!< The mask of the field. */
#define DRV_SX1509_EVENTSTATUS_PIN5_None      (0)                                      /*!< No event has occured on this IO. */
#define DRV_SX1509_EVENTSTATUS_PIN5_Triggered (1)                                      /*!< An event has occured on this IO (an edge as configured in relevant RegSense register occured). */


/* Field PIN4: Interrupt source (from IOs set in RegInterruptMask). */
#define DRV_SX1509_EVENTSTATUS_PIN4_Pos       (4)                                      /*!< The position of the field. */
#define DRV_SX1509_EVENTSTATUS_PIN4_Msk       (0x1 << DRV_SX1509_EVENTSTATUS_PIN4_Pos) /*!< The mask of the field. */
#define DRV_SX1509_EVENTSTATUS_PIN4_None      (0)                                      /*!< No event has occured on this IO. */
#define DRV_SX1509_EVENTSTATUS_PIN4_Triggered (1)                                      /*!< An event has occured on this IO (an edge as configured in relevant RegSense register occured). */


/* Field PIN3: Interrupt source (from IOs set in RegInterruptMask). */
#define DRV_SX1509_EVENTSTATUS_PIN3_Pos       (3)                                      /*!< The position of the field. */
#define DRV_SX1509_EVENTSTATUS_PIN3_Msk       (0x1 << DRV_SX1509_EVENTSTATUS_PIN3_Pos) /*!< The mask of the field. */
#define DRV_SX1509_EVENTSTATUS_PIN3_None      (0)                                      /*!< No event has occured on this IO. */
#define DRV_SX1509_EVENTSTATUS_PIN3_Triggered (1)                                      /*!< An event has occured on this IO (an edge as configured in relevant RegSense register occured). */


/* Field PIN2: Interrupt source (from IOs set in RegInterruptMask). */
#define DRV_SX1509_EVENTSTATUS_PIN2_Pos       (2)                                      /*!< The position of the field. */
#define DRV_SX1509_EVENTSTATUS_PIN2_Msk       (0x1 << DRV_SX1509_EVENTSTATUS_PIN2_Pos) /*!< The mask of the field. */
#define DRV_SX1509_EVENTSTATUS_PIN2_None      (0)                                      /*!< No event has occured on this IO. */
#define DRV_SX1509_EVENTSTATUS_PIN2_Triggered (1)                                      /*!< An event has occured on this IO (an edge as configured in relevant RegSense register occured). */


/* Field PIN1: Interrupt source (from IOs set in RegInterruptMask). */
#define DRV_SX1509_EVENTSTATUS_PIN1_Pos       (1)                                      /*!< The position of the field. */
#define DRV_SX1509_EVENTSTATUS_PIN1_Msk       (0x1 << DRV_SX1509_EVENTSTATUS_PIN1_Pos) /*!< The mask of the field. */
#define DRV_SX1509_EVENTSTATUS_PIN1_None      (0)                                      /*!< No event has occured on this IO. */
#define DRV_SX1509_EVENTSTATUS_PIN1_Triggered (1)                                      /*!< An event has occured on this IO (an edge as configured in relevant RegSense register occured). */


