NordicPlayground/nrf528xx-ble-throughput-demo/display_shield_files/inc/drv_sx1509_bitfields.h
/* Field PIN0: Interrupt source (from IOs set in RegInterruptMask). */
#define DRV_SX1509_EVENTSTATUS_PIN0_Pos       (0)                                      /*!< The position of the field. */
#define DRV_SX1509_EVENTSTATUS_PIN0_Msk       (0x1 << DRV_SX1509_EVENTSTATUS_PIN0_Pos) /*!< The mask of the field. */
#define DRV_SX1509_EVENTSTATUS_PIN0_None      (0)                                      /*!< No event has occured on this IO. */
#define DRV_SX1509_EVENTSTATUS_PIN0_Triggered (1)                                      /*!< An event has occured on this IO (an edge as configured in relevant RegSense register occured). */


/* Register: LEVELSHIFTER. */
/* Description: Level shifter register. */


/* Field MODE7: Level shifter mode for IO[n] (Bank A) and IO[8 + n] (Bank B). */
#define DRV_SX1509_LEVELSHIFTER_MODE7_Pos (14)                                       /*!< The position of the field. */
#define DRV_SX1509_LEVELSHIFTER_MODE7_Msk (0x3 << DRV_SX1509_LEVELSHIFTER_MODE7_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LEVELSHIFTER_MODE7_Off (0)                                        /*!< Level shifter is off. */
#define DRV_SX1509_LEVELSHIFTER_MODE7_AB  (1)                                        /*!< Shifting level from A to B. */
#define DRV_SX1509_LEVELSHIFTER_MODE7_BA  (2)                                        /*!< Shifting level from B to A. */


/* Field MODE6: Level shifter mode for IO[n] (Bank A) and IO[8 + n] (Bank B). */
#define DRV_SX1509_LEVELSHIFTER_MODE6_Pos (12)                                       /*!< The position of the field. */
#define DRV_SX1509_LEVELSHIFTER_MODE6_Msk (0x3 << DRV_SX1509_LEVELSHIFTER_MODE6_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LEVELSHIFTER_MODE6_Off (0)                                        /*!< Level shifter is off. */
#define DRV_SX1509_LEVELSHIFTER_MODE6_AB  (1)                                        /*!< Shifting level from A to B. */
#define DRV_SX1509_LEVELSHIFTER_MODE6_BA  (2)                                        /*!< Shifting level from B to A. */


/* Field MODE5: Level shifter mode for IO[n] (Bank A) and IO[8 + n] (Bank B). */
#define DRV_SX1509_LEVELSHIFTER_MODE5_Pos (10)                                       /*!< The position of the field. */
#define DRV_SX1509_LEVELSHIFTER_MODE5_Msk (0x3 << DRV_SX1509_LEVELSHIFTER_MODE5_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LEVELSHIFTER_MODE5_Off (0)                                        /*!< Level shifter is off. */
#define DRV_SX1509_LEVELSHIFTER_MODE5_AB  (1)                                        /*!< Shifting level from A to B. */
#define DRV_SX1509_LEVELSHIFTER_MODE5_BA  (2)                                        /*!< Shifting level from B to A. */


/* Field MODE4: Level shifter mode for IO[n] (Bank A) and IO[8 + n] (Bank B). */
#define DRV_SX1509_LEVELSHIFTER_MODE4_Pos (8)                                        /*!< The position of the field. */
#define DRV_SX1509_LEVELSHIFTER_MODE4_Msk (0x3 << DRV_SX1509_LEVELSHIFTER_MODE4_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LEVELSHIFTER_MODE4_Off (0)                                        /*!< Level shifter is off. */
#define DRV_SX1509_LEVELSHIFTER_MODE4_AB  (1)                                        /*!< Shifting level from A to B. */
#define DRV_SX1509_LEVELSHIFTER_MODE4_BA  (2)                                        /*!< Shifting level from B to A. */


/* Field MODE3: Level shifter mode for IO[n] (Bank A) and IO[8 + n] (Bank B). */
#define DRV_SX1509_LEVELSHIFTER_MODE3_Pos (6)                                        /*!< The position of the field. */
#define DRV_SX1509_LEVELSHIFTER_MODE3_Msk (0x3 << DRV_SX1509_LEVELSHIFTER_MODE3_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LEVELSHIFTER_MODE3_Off (0)                                        /*!< Level shifter is off. */
#define DRV_SX1509_LEVELSHIFTER_MODE3_AB  (1)                                        /*!< Shifting level from A to B. */
#define DRV_SX1509_LEVELSHIFTER_MODE3_BA  (2)                                        /*!< Shifting level from B to A. */


/* Field MODE2: Level shifter mode for IO[n] (Bank A) and IO[8 + n] (Bank B). */
#define DRV_SX1509_LEVELSHIFTER_MODE2_Pos (4)                                        /*!< The position of the field. */
#define DRV_SX1509_LEVELSHIFTER_MODE2_Msk (0x3 << DRV_SX1509_LEVELSHIFTER_MODE2_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LEVELSHIFTER_MODE2_Off (0)                                        /*!< Level shifter is off. */
#define DRV_SX1509_LEVELSHIFTER_MODE2_AB  (1)                                        /*!< Shifting level from A to B. */
#define DRV_SX1509_LEVELSHIFTER_MODE2_BA  (2)                                        /*!< Shifting level from B to A. */


/* Field MODE1: Level shifter mode for IO[n] (Bank A) and IO[8 + n] (Bank B). */
#define DRV_SX1509_LEVELSHIFTER_MODE1_Pos (2)                                        /*!< The position of the field. */
#define DRV_SX1509_LEVELSHIFTER_MODE1_Msk (0x3 << DRV_SX1509_LEVELSHIFTER_MODE1_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LEVELSHIFTER_MODE1_Off (0)                                        /*!< Level shifter is off. */
#define DRV_SX1509_LEVELSHIFTER_MODE1_AB  (1)                                        /*!< Shifting level from A to B. */
#define DRV_SX1509_LEVELSHIFTER_MODE1_BA  (2)                                        /*!< Shifting level from B to A. */


/* Field MODE0: Level shifter mode for IO[n] (Bank A) and IO[8 + n] (Bank B). */
#define DRV_SX1509_LEVELSHIFTER_MODE0_Pos (0)                                        /*!< The position of the field. */
#define DRV_SX1509_LEVELSHIFTER_MODE0_Msk (0x3 << DRV_SX1509_LEVELSHIFTER_MODE0_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LEVELSHIFTER_MODE0_Off (0)                                        /*!< Level shifter is off. */
#define DRV_SX1509_LEVELSHIFTER_MODE0_AB  (1)                                        /*!< Shifting level from A to B. */
#define DRV_SX1509_LEVELSHIFTER_MODE0_BA  (2)                                        /*!< Shifting level from B to A. */


