NordicPlayground/nrf528xx-ble-throughput-demo/display_shield_files/inc/drv_sx1509_bitfields.h
/* Register: CLOCK. */
/* Description: Clock management register. */


/* Field RESERVED0: Unused field. */
#define DRV_SX1509_CLOCK_RESERVED0_Pos (7)                                     /*!< The position of the field. */
#define DRV_SX1509_CLOCK_RESERVED0_Msk (0x1 << DRV_SX1509_CLOCK_RESERVED0_Pos) /*!< The mask of the field. */


/* Field FOSCSRC: Oscillator frequency (fOSC) source. */
#define DRV_SX1509_CLOCK_FOSCSRC_Pos     (5)                                   /*!< The position of the field. */
#define DRV_SX1509_CLOCK_FOSCSRC_Msk     (0x3 << DRV_SX1509_CLOCK_FOSCSRC_Pos) /*!< The mask of the field. */
#define DRV_SX1509_CLOCK_FOSCSRC_Off     (0)                                   /*!< LED driver, keypad engine and debounce features are disabled.. */
#define DRV_SX1509_CLOCK_FOSCSRC_OscIn   (1)                                   /*!< External clock input (OSCIN). */
#define DRV_SX1509_CLOCK_FOSCSRC_Int2MHz (2)                                   /*!< Internal 2MHz oscillator. */


/* Field OSCIODIR: OSCIO pin function (Cf. §4.8). */
#define DRV_SX1509_CLOCK_OSCIODIR_Pos    (4)                                    /*!< The position of the field. */
#define DRV_SX1509_CLOCK_OSCIODIR_Msk    (0x1 << DRV_SX1509_CLOCK_OSCIODIR_Pos) /*!< The mask of the field. */
#define DRV_SX1509_CLOCK_OSCIODIR_Input  (0)                                    /*!< OSCIO is an input (OSCIN). */
#define DRV_SX1509_CLOCK_OSCIODIR_Output (1)                                    /*!< OSCIO is an output (OSCOUT). */


/* Field FREQ: Frequency of the signal output on OSCOUT pin, fOSCOUT = fOSC/(2^(RegClock[3:0]-1)). */
#define DRV_SX1509_CLOCK_FREQ_Pos   (0)                                /*!< The position of the field. */
#define DRV_SX1509_CLOCK_FREQ_Msk   (0xF << DRV_SX1509_CLOCK_FREQ_Pos) /*!< The mask of the field. */
#define DRV_SX1509_CLOCK_FREQ_Lo0Hz (0)                                /*!< 0Hz, permanent "0" logical level (GPO). */
#define DRV_SX1509_CLOCK_FREQ_Hi0Hz (1)                                /*!< 0Hz, permanent "1" logical level (GPO). */


/* Register: MISC. */
/* Description: Miscellaneous device settings register. */


/* Field MODE: LED Driver mode for Bank B's fading capable IOs (IO15-12). */
#define DRV_SX1509_MISC_MODE_Pos         (7)                               /*!< The position of the field. */
#define DRV_SX1509_MISC_MODE_Msk         (0x1 << DRV_SX1509_MISC_MODE_Pos) /*!< The mask of the field. */
#define DRV_SX1509_MISC_MODE_Linear      (0)                               /*!< Linear fade. */
#define DRV_SX1509_MISC_MODE_Logarithmic (1)                               /*!< Logaritmic fade. */


/* Field CLKX: Frequency of the LED Driver clock ClkX of all IOs. */
#define DRV_SX1509_MISC_CLKX_Pos (4)                               /*!< The position of the field. */
#define DRV_SX1509_MISC_CLKX_Msk (0x7 << DRV_SX1509_MISC_CLKX_Pos) /*!< The mask of the field. */
#define DRV_SX1509_MISC_CLKX_Off (0)                               /*!< LED driver functionality is disabled for all IOs, else fOSC/(2^(<ClkX>-1)). */


/* Field DRVMODE: LED Driver mode for Bank A @s fading capable IOs (IO7-4). */
#define DRV_SX1509_MISC_DRVMODE_Pos         (3)                                  /*!< The position of the field. */
#define DRV_SX1509_MISC_DRVMODE_Msk         (0x1 << DRV_SX1509_MISC_DRVMODE_Pos) /*!< The mask of the field. */
#define DRV_SX1509_MISC_DRVMODE_Linear      (0)                                  /*!< Linear fade. */
#define DRV_SX1509_MISC_DRVMODE_Logarithmic (1)                                  /*!< Logaritmic fade. */


/* Field FUNC: NRESET pin function when externally forced low (Cf. §4.4.1 and §4.9.5). */
#define DRV_SX1509_MISC_FUNC_Pos    (2)                               /*!< The position of the field. */
#define DRV_SX1509_MISC_FUNC_Msk    (0x1 << DRV_SX1509_MISC_FUNC_Pos) /*!< The mask of the field. */
#define DRV_SX1509_MISC_FUNC_EqPOR  (0)                               /*!< Equivalent to POR. */
#define DRV_SX1509_MISC_FUNC_Lmited (1)                               /*!< Reset PWM/Blink/Fade counters (not user programmed values) This bit is can only be reset manually or by POR, not by NRESET. */


/* Field AUTOINC: Auto-increment register address (Cf. §4.5). */
#define DRV_SX1509_MISC_AUTOINC_Pos (1)                                  /*!< The position of the field. */
#define DRV_SX1509_MISC_AUTOINC_Msk (0x1 << DRV_SX1509_MISC_AUTOINC_Pos) /*!< The mask of the field. */
#define DRV_SX1509_MISC_AUTOINC_On  (0)                                  /*!<  When several consecutive data are read/written, register address is incremented. */
#define DRV_SX1509_MISC_AUTOINC_Off (1)                                  /*!< When several consecutive data are read/written, register address is kept fixed. */


/* Field AUTOCLR: Autoclear NINT on RegData read (Cf. §4.7). */
#define DRV_SX1509_MISC_AUTOCLR_Pos (0)                                  /*!< The position of the field. */
#define DRV_SX1509_MISC_AUTOCLR_Msk (0x1 << DRV_SX1509_MISC_AUTOCLR_Pos) /*!< The mask of the field. */
#define DRV_SX1509_MISC_AUTOCLR_On  (0)                                  /*!< RegInterruptSourceA/B is also automatically cleared when RegDataA/B is read. */
#define DRV_SX1509_MISC_AUTOCLR_Off (1)                                  /*!< RegInterruptSourceA/B must be manually cleared, either directly or via RegEventStatus. */


/* Register: LEDDRIVERENABLE. */
/* Description: LED driver enable register - I/O[n]. */


/* Field PIN15: Enables LED Driver for each [output-configured] IO. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN15_Pos      (15)                                          /*!< The position of the field. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN15_Msk      (0x1 << DRV_SX1509_LEDDRIVERENABLE_PIN15_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN15_Disabled (0)                                           /*!< LED Driver is disabled. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN15_Enabled  (1)                                           /*!< LED Driver is enabled. */


/* Field PIN14: Enables LED Driver for each [output-configured] IO. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN14_Pos      (14)                                          /*!< The position of the field. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN14_Msk      (0x1 << DRV_SX1509_LEDDRIVERENABLE_PIN14_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN14_Disabled (0)                                           /*!< LED Driver is disabled. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN14_Enabled  (1)                                           /*!< LED Driver is enabled. */


/* Field PIN13: Enables LED Driver for each [output-configured] IO. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN13_Pos      (13)                                          /*!< The position of the field. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN13_Msk      (0x1 << DRV_SX1509_LEDDRIVERENABLE_PIN13_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN13_Disabled (0)                                           /*!< LED Driver is disabled. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN13_Enabled  (1)                                           /*!< LED Driver is enabled. */


/* Field PIN12: Enables LED Driver for each [output-configured] IO. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN12_Pos      (12)                                          /*!< The position of the field. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN12_Msk      (0x1 << DRV_SX1509_LEDDRIVERENABLE_PIN12_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN12_Disabled (0)                                           /*!< LED Driver is disabled. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN12_Enabled  (1)                                           /*!< LED Driver is enabled. */


/* Field PIN11: Enables LED Driver for each [output-configured] IO. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN11_Pos      (11)                                          /*!< The position of the field. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN11_Msk      (0x1 << DRV_SX1509_LEDDRIVERENABLE_PIN11_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN11_Disabled (0)                                           /*!< LED Driver is disabled. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN11_Enabled  (1)                                           /*!< LED Driver is enabled. */


/* Field PIN10: Enables LED Driver for each [output-configured] IO. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN10_Pos      (10)                                          /*!< The position of the field. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN10_Msk      (0x1 << DRV_SX1509_LEDDRIVERENABLE_PIN10_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN10_Disabled (0)                                           /*!< LED Driver is disabled. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN10_Enabled  (1)                                           /*!< LED Driver is enabled. */


/* Field PIN9: Enables LED Driver for each [output-configured] IO. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN9_Pos      (9)                                          /*!< The position of the field. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN9_Msk      (0x1 << DRV_SX1509_LEDDRIVERENABLE_PIN9_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN9_Disabled (0)                                          /*!< LED Driver is disabled. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN9_Enabled  (1)                                          /*!< LED Driver is enabled. */


/* Field PIN8: Enables LED Driver for each [output-configured] IO. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN8_Pos      (8)                                          /*!< The position of the field. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN8_Msk      (0x1 << DRV_SX1509_LEDDRIVERENABLE_PIN8_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN8_Disabled (0)                                          /*!< LED Driver is disabled. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN8_Enabled  (1)                                          /*!< LED Driver is enabled. */


/* Field PIN7: Enables LED Driver for each [output-configured] IO. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN7_Pos      (7)                                          /*!< The position of the field. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN7_Msk      (0x1 << DRV_SX1509_LEDDRIVERENABLE_PIN7_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN7_Disabled (0)                                          /*!< LED Driver is disabled. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN7_Enabled  (1)                                          /*!< LED Driver is enabled. */


/* Field PIN6: Enables LED Driver for each [output-configured] IO. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN6_Pos      (6)                                          /*!< The position of the field. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN6_Msk      (0x1 << DRV_SX1509_LEDDRIVERENABLE_PIN6_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN6_Disabled (0)                                          /*!< LED Driver is disabled. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN6_Enabled  (1)                                          /*!< LED Driver is enabled. */


/* Field PIN5: Enables LED Driver for each [output-configured] IO. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN5_Pos      (5)                                          /*!< The position of the field. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN5_Msk      (0x1 << DRV_SX1509_LEDDRIVERENABLE_PIN5_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN5_Disabled (0)                                          /*!< LED Driver is disabled. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN5_Enabled  (1)                                          /*!< LED Driver is enabled. */


/* Field PIN4: Enables LED Driver for each [output-configured] IO. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN4_Pos      (4)                                          /*!< The position of the field. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN4_Msk      (0x1 << DRV_SX1509_LEDDRIVERENABLE_PIN4_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN4_Disabled (0)                                          /*!< LED Driver is disabled. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN4_Enabled  (1)                                          /*!< LED Driver is enabled. */


/* Field PIN3: Enables LED Driver for each [output-configured] IO. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN3_Pos      (3)                                          /*!< The position of the field. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN3_Msk      (0x1 << DRV_SX1509_LEDDRIVERENABLE_PIN3_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN3_Disabled (0)                                          /*!< LED Driver is disabled. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN3_Enabled  (1)                                          /*!< LED Driver is enabled. */


/* Field PIN2: Enables LED Driver for each [output-configured] IO. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN2_Pos      (2)                                          /*!< The position of the field. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN2_Msk      (0x1 << DRV_SX1509_LEDDRIVERENABLE_PIN2_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN2_Disabled (0)                                          /*!< LED Driver is disabled. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN2_Enabled  (1)                                          /*!< LED Driver is enabled. */


/* Field PIN1: Enables LED Driver for each [output-configured] IO. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN1_Pos      (1)                                          /*!< The position of the field. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN1_Msk      (0x1 << DRV_SX1509_LEDDRIVERENABLE_PIN1_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN1_Disabled (0)                                          /*!< LED Driver is disabled. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN1_Enabled  (1)                                          /*!< LED Driver is enabled. */


/* Field PIN0: Enables LED Driver for each [output-configured] IO. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN0_Pos      (0)                                          /*!< The position of the field. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN0_Msk      (0x1 << DRV_SX1509_LEDDRIVERENABLE_PIN0_Pos) /*!< The mask of the field. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN0_Disabled (0)                                          /*!< LED Driver is disabled. */
#define DRV_SX1509_LEDDRIVERENABLE_PIN0_Enabled  (1)                                          /*!< LED Driver is enabled. */


/* Register: DEBOUNCECONFIG. */
/* Description: Debounce configuration register. */


/* Field RESERVED0: Unused field. */
#define DRV_SX1509_DEBOUNCECONFIG_RESERVED0_Pos (3)                                               /*!< The position of the field. */
#define DRV_SX1509_DEBOUNCECONFIG_RESERVED0_Msk (0x1F << DRV_SX1509_DEBOUNCECONFIG_RESERVED0_Pos) /*!< The mask of the field. */


