NordicPlayground/nrf528xx-ble-throughput-demo/display_shield_files/inc/drv_sx1509_bitfields.h
/* Field TIME: Debounce time (Cf. §4.6.1). */
#define DRV_SX1509_DEBOUNCECONFIG_TIME_Pos  (0)                                         /*!< The position of the field. */
#define DRV_SX1509_DEBOUNCECONFIG_TIME_Msk  (0x7 << DRV_SX1509_DEBOUNCECONFIG_TIME_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DEBOUNCECONFIG_TIME_0ms5 (0)                                         /*!< 0.5ms x 2MHz/fOSC. */
#define DRV_SX1509_DEBOUNCECONFIG_TIME_1ms  (1)                                         /*!< 1ms x 2MHz/fOSC. */
#define DRV_SX1509_DEBOUNCECONFIG_TIME_2ms  (2)                                         /*!< 1ms x 2MHz/fOSC. */
#define DRV_SX1509_DEBOUNCECONFIG_TIME_4ms  (3)                                         /*!< 1ms x 2MHz/fOSC. */
#define DRV_SX1509_DEBOUNCECONFIG_TIME_8ms  (4)                                         /*!< 1ms x 2MHz/fOSC. */
#define DRV_SX1509_DEBOUNCECONFIG_TIME_16ms (5)                                         /*!< 1ms x 2MHz/fOSC. */
#define DRV_SX1509_DEBOUNCECONFIG_TIME_32ms (6)                                         /*!< 1ms x 2MHz/fOSC. */
#define DRV_SX1509_DEBOUNCECONFIG_TIME_64ms (7)                                         /*!< 1ms x 2MHz/fOSC. */


/* Register: DEBOUNCEENABLE. */
/* Description: Debounce enable register - I/O[n]. */


/* Field PIN15: Enables debouncing for each [input-configured] IO. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN15_Pos      (15)                                         /*!< The position of the field. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN15_Msk      (0x1 << DRV_SX1509_DEBOUNCEENABLE_PIN15_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN15_Disabled (0)                                          /*!< Debouncing is disabled. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN15_Enabled  (1)                                          /*!< Debouncing is enabled. */


/* Field PIN14: Enables debouncing for each [input-configured] IO. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN14_Pos      (14)                                         /*!< The position of the field. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN14_Msk      (0x1 << DRV_SX1509_DEBOUNCEENABLE_PIN14_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN14_Disabled (0)                                          /*!< Debouncing is disabled. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN14_Enabled  (1)                                          /*!< Debouncing is enabled. */


/* Field PIN13: Enables debouncing for each [input-configured] IO. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN13_Pos      (13)                                         /*!< The position of the field. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN13_Msk      (0x1 << DRV_SX1509_DEBOUNCEENABLE_PIN13_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN13_Disabled (0)                                          /*!< Debouncing is disabled. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN13_Enabled  (1)                                          /*!< Debouncing is enabled. */


/* Field PIN12: Enables debouncing for each [input-configured] IO. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN12_Pos      (12)                                         /*!< The position of the field. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN12_Msk      (0x1 << DRV_SX1509_DEBOUNCEENABLE_PIN12_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN12_Disabled (0)                                          /*!< Debouncing is disabled. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN12_Enabled  (1)                                          /*!< Debouncing is enabled. */


/* Field PIN11: Enables debouncing for each [input-configured] IO. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN11_Pos      (11)                                         /*!< The position of the field. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN11_Msk      (0x1 << DRV_SX1509_DEBOUNCEENABLE_PIN11_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN11_Disabled (0)                                          /*!< Debouncing is disabled. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN11_Enabled  (1)                                          /*!< Debouncing is enabled. */


/* Field PIN10: Enables debouncing for each [input-configured] IO. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN10_Pos      (10)                                         /*!< The position of the field. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN10_Msk      (0x1 << DRV_SX1509_DEBOUNCEENABLE_PIN10_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN10_Disabled (0)                                          /*!< Debouncing is disabled. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN10_Enabled  (1)                                          /*!< Debouncing is enabled. */


/* Field PIN9: Enables debouncing for each [input-configured] IO. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN9_Pos      (9)                                         /*!< The position of the field. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN9_Msk      (0x1 << DRV_SX1509_DEBOUNCEENABLE_PIN9_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN9_Disabled (0)                                         /*!< Debouncing is disabled. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN9_Enabled  (1)                                         /*!< Debouncing is enabled. */


/* Field PIN8: Enables debouncing for each [input-configured] IO. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN8_Pos      (8)                                         /*!< The position of the field. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN8_Msk      (0x1 << DRV_SX1509_DEBOUNCEENABLE_PIN8_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN8_Disabled (0)                                         /*!< Debouncing is disabled. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN8_Enabled  (1)                                         /*!< Debouncing is enabled. */


/* Field PIN7: Enables debouncing for each [input-configured] IO. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN7_Pos      (7)                                         /*!< The position of the field. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN7_Msk      (0x1 << DRV_SX1509_DEBOUNCEENABLE_PIN7_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN7_Disabled (0)                                         /*!< Debouncing is disabled. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN7_Enabled  (1)                                         /*!< Debouncing is enabled. */


/* Field PIN6: Enables debouncing for each [input-configured] IO. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN6_Pos      (6)                                         /*!< The position of the field. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN6_Msk      (0x1 << DRV_SX1509_DEBOUNCEENABLE_PIN6_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN6_Disabled (0)                                         /*!< Debouncing is disabled. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN6_Enabled  (1)                                         /*!< Debouncing is enabled. */


/* Field PIN5: Enables debouncing for each [input-configured] IO. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN5_Pos      (5)                                         /*!< The position of the field. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN5_Msk      (0x1 << DRV_SX1509_DEBOUNCEENABLE_PIN5_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN5_Disabled (0)                                         /*!< Debouncing is disabled. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN5_Enabled  (1)                                         /*!< Debouncing is enabled. */


/* Field PIN4: Enables debouncing for each [input-configured] IO. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN4_Pos      (4)                                         /*!< The position of the field. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN4_Msk      (0x1 << DRV_SX1509_DEBOUNCEENABLE_PIN4_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN4_Disabled (0)                                         /*!< Debouncing is disabled. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN4_Enabled  (1)                                         /*!< Debouncing is enabled. */


