NordicPlayground/nrf528xx-ble-throughput-demo/display_shield_files/inc/drv_sx1509_bitfields.h
/* Field PIN3: Enables debouncing for each [input-configured] IO. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN3_Pos      (3)                                         /*!< The position of the field. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN3_Msk      (0x1 << DRV_SX1509_DEBOUNCEENABLE_PIN3_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN3_Disabled (0)                                         /*!< Debouncing is disabled. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN3_Enabled  (1)                                         /*!< Debouncing is enabled. */


/* Field PIN2: Enables debouncing for each [input-configured] IO. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN2_Pos      (2)                                         /*!< The position of the field. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN2_Msk      (0x1 << DRV_SX1509_DEBOUNCEENABLE_PIN2_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN2_Disabled (0)                                         /*!< Debouncing is disabled. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN2_Enabled  (1)                                         /*!< Debouncing is enabled. */


/* Field PIN1: Enables debouncing for each [input-configured] IO. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN1_Pos      (1)                                         /*!< The position of the field. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN1_Msk      (0x1 << DRV_SX1509_DEBOUNCEENABLE_PIN1_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN1_Disabled (0)                                         /*!< Debouncing is disabled. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN1_Enabled  (1)                                         /*!< Debouncing is enabled. */


/* Field PIN0: Enables debouncing for each [input-configured] IO. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN0_Pos      (0)                                         /*!< The position of the field. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN0_Msk      (0x1 << DRV_SX1509_DEBOUNCEENABLE_PIN0_Pos) /*!< The mask of the field. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN0_Disabled (0)                                         /*!< Debouncing is disabled. */
#define DRV_SX1509_DEBOUNCEENABLE_PIN0_Enabled  (1)                                         /*!< Debouncing is enabled. */


/* Register: KEYCONFIG. */
/* Description: Key scan configuration register. */


/* Field RESERVED2: Unused field. */
#define DRV_SX1509_KEYCONFIG_RESERVED2_Pos (15)                                        /*!< The position of the field. */
#define DRV_SX1509_KEYCONFIG_RESERVED2_Msk (0x1 << DRV_SX1509_KEYCONFIG_RESERVED2_Pos) /*!< The mask of the field. */


/* Field AUTOSLEEPTIME: Auto Sleep time (no key press within this time will set keypad engine to sleep). */
#define DRV_SX1509_KEYCONFIG_AUTOSLEEPTIME_Pos   (12)                                            /*!< The position of the field. */
#define DRV_SX1509_KEYCONFIG_AUTOSLEEPTIME_Msk   (0x7 << DRV_SX1509_KEYCONFIG_AUTOSLEEPTIME_Pos) /*!< The mask of the field. */
#define DRV_SX1509_KEYCONFIG_AUTOSLEEPTIME_Off   (0)                                             /*!< Auto sleep time is off. */
#define DRV_SX1509_KEYCONFIG_AUTOSLEEPTIME_128ms (1)                                             /*!< 128ms x 2MHz/fOSC. */
#define DRV_SX1509_KEYCONFIG_AUTOSLEEPTIME_256ms (2)                                             /*!< 256ms x 2MHz/fOSC. */
#define DRV_SX1509_KEYCONFIG_AUTOSLEEPTIME_512ms (3)                                             /*!< 512ms x 2MHz/fOSC. */
#define DRV_SX1509_KEYCONFIG_AUTOSLEEPTIME_1s    (4)                                             /*!< 1s x 2MHz/fOSC. */
#define DRV_SX1509_KEYCONFIG_AUTOSLEEPTIME_2s    (5)                                             /*!< 2s x 2MHz/fOSC. */
#define DRV_SX1509_KEYCONFIG_AUTOSLEEPTIME_4s    (6)                                             /*!< 4s x 2MHz/fOSC. */
#define DRV_SX1509_KEYCONFIG_AUTOSLEEPTIME_8s    (7)                                             /*!< 8s x 2MHz/fOSC. */


/* Field RESERVED1: Unused field. */
#define DRV_SX1509_KEYCONFIG_RESERVED1_Pos (11)                                        /*!< The position of the field. */
#define DRV_SX1509_KEYCONFIG_RESERVED1_Msk (0x1 << DRV_SX1509_KEYCONFIG_RESERVED1_Pos) /*!< The mask of the field. */


/* Field SCANTIME: Scan time per row (must be set above debounce time). */
#define DRV_SX1509_KEYCONFIG_SCANTIME_Pos   (8)                                        /*!< The position of the field. */
#define DRV_SX1509_KEYCONFIG_SCANTIME_Msk   (0x7 << DRV_SX1509_KEYCONFIG_SCANTIME_Pos) /*!< The mask of the field. */
#define DRV_SX1509_KEYCONFIG_SCANTIME_1ms   (0)                                        /*!< 1ms x 2MHz/fOSC. */
#define DRV_SX1509_KEYCONFIG_SCANTIME_2ms   (1)                                        /*!< 2ms x 2MHz/fOSC. */
#define DRV_SX1509_KEYCONFIG_SCANTIME_4ms   (2)                                        /*!< 4ms x 2MHz/fOSC. */
#define DRV_SX1509_KEYCONFIG_SCANTIME_8ms   (3)                                        /*!< 8ms x 2MHz/fOSC. */
#define DRV_SX1509_KEYCONFIG_SCANTIME_16ms  (4)                                        /*!< 16ms x 2MHz/fOSC. */
#define DRV_SX1509_KEYCONFIG_SCANTIME_32ms  (5)                                        /*!< 32ms x 2MHz/fOSC. */
#define DRV_SX1509_KEYCONFIG_SCANTIME_64ms  (6)                                        /*!< 64ms x 2MHz/fOSC. */
#define DRV_SX1509_KEYCONFIG_SCANTIME_128ms (7)                                        /*!< 128ms x 2MHz/fOSC. */


/* Field RESERVED0: Unused field. */
#define DRV_SX1509_KEYCONFIG_RESERVED0_Pos (6)                                         /*!< The position of the field. */
#define DRV_SX1509_KEYCONFIG_RESERVED0_Msk (0x3 << DRV_SX1509_KEYCONFIG_RESERVED0_Pos) /*!< The mask of the field. */


/* Field ROWS: Number of rows (outputs) + key scan enable. */
#define DRV_SX1509_KEYCONFIG_ROWS_Pos   (3)                                    /*!< The position of the field. */
#define DRV_SX1509_KEYCONFIG_ROWS_Msk   (0x7 << DRV_SX1509_KEYCONFIG_ROWS_Pos) /*!< The mask of the field. */
#define DRV_SX1509_KEYCONFIG_ROWS_Off   (0)                                    /*!< Key scan is off. */
#define DRV_SX1509_KEYCONFIG_ROWS_2Rows (1)                                    /*!< 2 rows - IO[0:1]. */
#define DRV_SX1509_KEYCONFIG_ROWS_3Rows (2)                                    /*!< 3 rows - IO[0:2]. */
#define DRV_SX1509_KEYCONFIG_ROWS_4Rows (3)                                    /*!< 4 rows - IO[0:3]. */
#define DRV_SX1509_KEYCONFIG_ROWS_5Rows (4)                                    /*!< 5 rows - IO[0:4]. */
#define DRV_SX1509_KEYCONFIG_ROWS_6Rows (5)                                    /*!< 6 rows - IO[0:5]. */
#define DRV_SX1509_KEYCONFIG_ROWS_7Rows (6)                                    /*!< 7 rows - IO[0:6]. */
#define DRV_SX1509_KEYCONFIG_ROWS_8Rows (7)                                    /*!< 8 rows - IO[0:7]. */


/* Field COLS: Number of columns (inputs). */
#define DRV_SX1509_KEYCONFIG_COLS_Pos   (0)                                    /*!< The position of the field. */
#define DRV_SX1509_KEYCONFIG_COLS_Msk   (0x7 << DRV_SX1509_KEYCONFIG_COLS_Pos) /*!< The mask of the field. */
#define DRV_SX1509_KEYCONFIG_COLS_1Col  (0)                                    /*!< 1 column - IO[8]. */
#define DRV_SX1509_KEYCONFIG_COLS_2Cols (1)                                    /*!< 2 columns - IO[8:9]. */
#define DRV_SX1509_KEYCONFIG_COLS_3Cols (2)                                    /*!< 3 columns - IO[8:10]. */
#define DRV_SX1509_KEYCONFIG_COLS_4Cols (3)                                    /*!< 4 columns - IO[8:11]. */
#define DRV_SX1509_KEYCONFIG_COLS_5Cols (4)                                    /*!< 5 columns - IO[8:12]. */
#define DRV_SX1509_KEYCONFIG_COLS_6Cols (5)                                    /*!< 6 columns - IO[8:13]. */
#define DRV_SX1509_KEYCONFIG_COLS_7Cols (6)                                    /*!< 7 columns - IO[8:14]. */
#define DRV_SX1509_KEYCONFIG_COLS_8Cols (7)                                    /*!< 8 columns - IO[8:15]. */


/* Register: KEYDATA. */
/* Description: Key value. */


/* Field COLINTR7: Column which generated NINT (active low in HW, intentionally active high through driver interface). */
#define DRV_SX1509_KEYDATA_COLINTR7_Pos       (15)                                     /*!< The position of the field. */
#define DRV_SX1509_KEYDATA_COLINTR7_Msk       (0x1 << DRV_SX1509_KEYDATA_COLINTR7_Pos) /*!< The mask of the field. */
#define DRV_SX1509_KEYDATA_COLINTR7_None      (0)                                      /*!< Collumn did not generate NINT (intentional oposite polarity from HW to be similar to InterruptSource and EventStatus registers). */
#define DRV_SX1509_KEYDATA_COLINTR7_Triggered (1)                                      /*!< Column generated NINT (intentional oposite polarity from HW to be similar to InterruptSource and EventStatus registers). */


/* Field COLINTR6: Column which generated NINT (active low in HW, intentionally active high through driver interface). */
#define DRV_SX1509_KEYDATA_COLINTR6_Pos       (14)                                     /*!< The position of the field. */
#define DRV_SX1509_KEYDATA_COLINTR6_Msk       (0x1 << DRV_SX1509_KEYDATA_COLINTR6_Pos) /*!< The mask of the field. */
#define DRV_SX1509_KEYDATA_COLINTR6_None      (0)                                      /*!< Collumn did not generate NINT (intentional oposite polarity from HW to be similar to InterruptSource and EventStatus registers). */
#define DRV_SX1509_KEYDATA_COLINTR6_Triggered (1)                                      /*!< Column generated NINT (intentional oposite polarity from HW to be similar to InterruptSource and EventStatus registers). */


/* Field COLINTR5: Column which generated NINT (active low in HW, intentionally active high through driver interface). */
#define DRV_SX1509_KEYDATA_COLINTR5_Pos       (13)                                     /*!< The position of the field. */
#define DRV_SX1509_KEYDATA_COLINTR5_Msk       (0x1 << DRV_SX1509_KEYDATA_COLINTR5_Pos) /*!< The mask of the field. */
#define DRV_SX1509_KEYDATA_COLINTR5_None      (0)                                      /*!< Collumn did not generate NINT (intentional oposite polarity from HW to be similar to InterruptSource and EventStatus registers). */
#define DRV_SX1509_KEYDATA_COLINTR5_Triggered (1)                                      /*!< Column generated NINT (intentional oposite polarity from HW to be similar to InterruptSource and EventStatus registers). */


