NordicPlayground/nrf528xx-ble-throughput-demo/display_shield_files/inc/drv_sx1509_bitfields.h
/* Field COLINTR4: Column which generated NINT (active low in HW, intentionally active high through driver interface). */
#define DRV_SX1509_KEYDATA_COLINTR4_Pos       (12)                                     /*!< The position of the field. */
#define DRV_SX1509_KEYDATA_COLINTR4_Msk       (0x1 << DRV_SX1509_KEYDATA_COLINTR4_Pos) /*!< The mask of the field. */
#define DRV_SX1509_KEYDATA_COLINTR4_None      (0)                                      /*!< Collumn did not generate NINT (intentional oposite polarity from HW to be similar to InterruptSource and EventStatus registers). */
#define DRV_SX1509_KEYDATA_COLINTR4_Triggered (1)                                      /*!< Column generated NINT (intentional oposite polarity from HW to be similar to InterruptSource and EventStatus registers). */


/* Field COLINTR3: Column which generated NINT (active low in HW, intentionally active high through driver interface). */
#define DRV_SX1509_KEYDATA_COLINTR3_Pos       (11)                                     /*!< The position of the field. */
#define DRV_SX1509_KEYDATA_COLINTR3_Msk       (0x1 << DRV_SX1509_KEYDATA_COLINTR3_Pos) /*!< The mask of the field. */
#define DRV_SX1509_KEYDATA_COLINTR3_None      (0)                                      /*!< Collumn did not generate NINT (intentional oposite polarity from HW to be similar to InterruptSource and EventStatus registers). */
#define DRV_SX1509_KEYDATA_COLINTR3_Triggered (1)                                      /*!< Column generated NINT (intentional oposite polarity from HW to be similar to InterruptSource and EventStatus registers). */


/* Field COLINTR2: Column which generated NINT (active low in HW, intentionally active high through driver interface). */
#define DRV_SX1509_KEYDATA_COLINTR2_Pos       (10)                                     /*!< The position of the field. */
#define DRV_SX1509_KEYDATA_COLINTR2_Msk       (0x1 << DRV_SX1509_KEYDATA_COLINTR2_Pos) /*!< The mask of the field. */
#define DRV_SX1509_KEYDATA_COLINTR2_None      (0)                                      /*!< Collumn did not generate NINT (intentional oposite polarity from HW to be similar to InterruptSource and EventStatus registers). */
#define DRV_SX1509_KEYDATA_COLINTR2_Triggered (1)                                      /*!< Column generated NINT (intentional oposite polarity from HW to be similar to InterruptSource and EventStatus registers). */


/* Field COLINTR1: Column which generated NINT (active low in HW, intentionally active high through driver interface). */
#define DRV_SX1509_KEYDATA_COLINTR1_Pos       (9)                                      /*!< The position of the field. */
#define DRV_SX1509_KEYDATA_COLINTR1_Msk       (0x1 << DRV_SX1509_KEYDATA_COLINTR1_Pos) /*!< The mask of the field. */
#define DRV_SX1509_KEYDATA_COLINTR1_None      (0)                                      /*!< Collumn did not generate NINT (intentional oposite polarity from HW to be similar to InterruptSource and EventStatus registers). */
#define DRV_SX1509_KEYDATA_COLINTR1_Triggered (1)                                      /*!< Column generated NINT (intentional oposite polarity from HW to be similar to InterruptSource and EventStatus registers). */


/* Field COLINTR0: Column which generated NINT (active low in HW, intentionally active high through driver interface). */
#define DRV_SX1509_KEYDATA_COLINTR0_Pos       (8)                                      /*!< The position of the field. */
#define DRV_SX1509_KEYDATA_COLINTR0_Msk       (0x1 << DRV_SX1509_KEYDATA_COLINTR0_Pos) /*!< The mask of the field. */
#define DRV_SX1509_KEYDATA_COLINTR0_None      (0)                                      /*!< Collumn did not generate NINT (intentional oposite polarity from HW to be similar to InterruptSource and EventStatus registers). */
#define DRV_SX1509_KEYDATA_COLINTR0_Triggered (1)                                      /*!< Column generated NINT (intentional oposite polarity from HW to be similar to InterruptSource and EventStatus registers). */


/* Field ROWINTR7: Row which generated NINT (active low). */
#define DRV_SX1509_KEYDATA_ROWINTR7_Pos       (7)                                      /*!< The position of the field. */
#define DRV_SX1509_KEYDATA_ROWINTR7_Msk       (0x1 << DRV_SX1509_KEYDATA_ROWINTR7_Pos) /*!< The mask of the field. */
#define DRV_SX1509_KEYDATA_ROWINTR7_None      (0)                                      /*!< Collumn did not generate NINT (intentional oposite polarity from HW to be similar to InterruptSource and EventStatus registers). */
#define DRV_SX1509_KEYDATA_ROWINTR7_Triggered (1)                                      /*!< Column generated NINT (intentional oposite polarity from HW to be similar to InterruptSource and EventStatus registers). */


/* Field ROWINTR6: Row which generated NINT (active low). */
#define DRV_SX1509_KEYDATA_ROWINTR6_Pos       (6)                                      /*!< The position of the field. */
#define DRV_SX1509_KEYDATA_ROWINTR6_Msk       (0x1 << DRV_SX1509_KEYDATA_ROWINTR6_Pos) /*!< The mask of the field. */
#define DRV_SX1509_KEYDATA_ROWINTR6_None      (0)                                      /*!< Collumn did not generate NINT (intentional oposite polarity from HW to be similar to InterruptSource and EventStatus registers). */
#define DRV_SX1509_KEYDATA_ROWINTR6_Triggered (1)                                      /*!< Column generated NINT (intentional oposite polarity from HW to be similar to InterruptSource and EventStatus registers). */


/* Field ROWINTR5: Row which generated NINT (active low). */
#define DRV_SX1509_KEYDATA_ROWINTR5_Pos       (5)                                      /*!< The position of the field. */
#define DRV_SX1509_KEYDATA_ROWINTR5_Msk       (0x1 << DRV_SX1509_KEYDATA_ROWINTR5_Pos) /*!< The mask of the field. */
#define DRV_SX1509_KEYDATA_ROWINTR5_None      (0)                                      /*!< Collumn did not generate NINT (intentional oposite polarity from HW to be similar to InterruptSource and EventStatus registers). */
#define DRV_SX1509_KEYDATA_ROWINTR5_Triggered (1)                                      /*!< Column generated NINT (intentional oposite polarity from HW to be similar to InterruptSource and EventStatus registers). */


/* Field ROWINTR4: Row which generated NINT (active low). */
#define DRV_SX1509_KEYDATA_ROWINTR4_Pos       (4)                                      /*!< The position of the field. */
#define DRV_SX1509_KEYDATA_ROWINTR4_Msk       (0x1 << DRV_SX1509_KEYDATA_ROWINTR4_Pos) /*!< The mask of the field. */
#define DRV_SX1509_KEYDATA_ROWINTR4_None      (0)                                      /*!< Collumn did not generate NINT (intentional oposite polarity from HW to be similar to InterruptSource and EventStatus registers). */
#define DRV_SX1509_KEYDATA_ROWINTR4_Triggered (1)                                      /*!< Column generated NINT (intentional oposite polarity from HW to be similar to InterruptSource and EventStatus registers). */


