NordicPlayground/nrf528xx-ble-throughput-demo/display_shield_files/inc/drv_sx1509_bitfields.h
/* Field ROWINTR3: Row which generated NINT (active low). */
#define DRV_SX1509_KEYDATA_ROWINTR3_Pos       (3)                                      /*!< The position of the field. */
#define DRV_SX1509_KEYDATA_ROWINTR3_Msk       (0x1 << DRV_SX1509_KEYDATA_ROWINTR3_Pos) /*!< The mask of the field. */
#define DRV_SX1509_KEYDATA_ROWINTR3_None      (0)                                      /*!< Collumn did not generate NINT (intentional oposite polarity from HW to be similar to InterruptSource and EventStatus registers). */
#define DRV_SX1509_KEYDATA_ROWINTR3_Triggered (1)                                      /*!< Column generated NINT (intentional oposite polarity from HW to be similar to InterruptSource and EventStatus registers). */


/* Field ROWINTR2: Row which generated NINT (active low). */
#define DRV_SX1509_KEYDATA_ROWINTR2_Pos       (2)                                      /*!< The position of the field. */
#define DRV_SX1509_KEYDATA_ROWINTR2_Msk       (0x1 << DRV_SX1509_KEYDATA_ROWINTR2_Pos) /*!< The mask of the field. */
#define DRV_SX1509_KEYDATA_ROWINTR2_None      (0)                                      /*!< Collumn did not generate NINT (intentional oposite polarity from HW to be similar to InterruptSource and EventStatus registers). */
#define DRV_SX1509_KEYDATA_ROWINTR2_Triggered (1)                                      /*!< Column generated NINT (intentional oposite polarity from HW to be similar to InterruptSource and EventStatus registers). */


/* Field ROWINTR1: Row which generated NINT (active low). */
#define DRV_SX1509_KEYDATA_ROWINTR1_Pos       (1)                                      /*!< The position of the field. */
#define DRV_SX1509_KEYDATA_ROWINTR1_Msk       (0x1 << DRV_SX1509_KEYDATA_ROWINTR1_Pos) /*!< The mask of the field. */
#define DRV_SX1509_KEYDATA_ROWINTR1_None      (0)                                      /*!< Collumn did not generate NINT (intentional oposite polarity from HW to be similar to InterruptSource and EventStatus registers). */
#define DRV_SX1509_KEYDATA_ROWINTR1_Triggered (1)                                      /*!< Column generated NINT (intentional oposite polarity from HW to be similar to InterruptSource and EventStatus registers). */


/* Field ROWINTR0: Row which generated NINT (active low). */
#define DRV_SX1509_KEYDATA_ROWINTR0_Pos       (0)                                      /*!< The position of the field. */
#define DRV_SX1509_KEYDATA_ROWINTR0_Msk       (0x1 << DRV_SX1509_KEYDATA_ROWINTR0_Pos) /*!< The mask of the field. */
#define DRV_SX1509_KEYDATA_ROWINTR0_None      (0)                                      /*!< Collumn did not generate NINT (intentional oposite polarity from HW to be similar to InterruptSource and EventStatus registers). */
#define DRV_SX1509_KEYDATA_ROWINTR0_Triggered (1)                                      /*!< Column generated NINT (intentional oposite polarity from HW to be similar to InterruptSource and EventStatus registers). */


/* Register: ONOFFCFGX. */
/* Description: ON/OFF time/intensity register for I/O[n]. */


/* Field RESERVED0: Unused field. */
#define DRV_SX1509_ONOFFCFGX_RESERVED0_Pos (21)                                        /*!< The position of the field. */
#define DRV_SX1509_ONOFFCFGX_RESERVED0_Msk (0x7 << DRV_SX1509_ONOFFCFGX_RESERVED0_Pos) /*!< The mask of the field. */


/* Field ONTIME: ON Time of IO[n] (1 - 15 : TOnX = 64 * RegTOnX * (255/ClkX), 16 - 31 : TOnX = 512 * RegTOnX * (255/ClkX)). */
#define DRV_SX1509_ONOFFCFGX_ONTIME_Pos      (16)                                      /*!< The position of the field. */
#define DRV_SX1509_ONOFFCFGX_ONTIME_Msk      (0x1F << DRV_SX1509_ONOFFCFGX_ONTIME_Pos) /*!< The mask of the field. */
#define DRV_SX1509_ONOFFCFGX_ONTIME_Infinite (0)                                       /*!< Infinite (Static mode, TOn directly controlled by RegData, Cf §4.9.2). */


/* Field ONINTENSITY: ON Intensity of IO[n] (Linear mode : IOnX = RegIOnN, Logarithmic mode (fading capable IOs only, Cf §4.9.5) : IOnN = f(RegIOnN)). */
#define DRV_SX1509_ONOFFCFGX_ONINTENSITY_Pos (8)                                            /*!< The position of the field. */
#define DRV_SX1509_ONOFFCFGX_ONINTENSITY_Msk (0xFF << DRV_SX1509_ONOFFCFGX_ONINTENSITY_Pos) /*!< The mask of the field. */


/* Field OFFTIME: OFF Time of IO[n], (1 - 15 : TOffN = 64 * RegOffN[7:3] * (255/ClkN), 16 - 31 : TOffN = 512 * RegOffN[7:3] * (255/ClkN)). */
#define DRV_SX1509_ONOFFCFGX_OFFTIME_Pos      (3)                                        /*!< The position of the field. */
#define DRV_SX1509_ONOFFCFGX_OFFTIME_Msk      (0x1F << DRV_SX1509_ONOFFCFGX_OFFTIME_Pos) /*!< The mask of the field. */
#define DRV_SX1509_ONOFFCFGX_OFFTIME_Infinite (0)                                        /*!< Infinite (Single shot mode, TOff directly controlled by RegData, Cf §4.9.3). */


/* Field OFFINTENSITY: OFF Intensity of IO[n] (Linear mode : IOffN = 4 x RegOff[2:0], Logarithmic mode (fading capable IOs only, Cf §4.9.5) : IOffN = f(4 x RegOffN[2:0])). */
#define DRV_SX1509_ONOFFCFGX_OFFINTENSITY_Pos (0)                                            /*!< The position of the field. */
#define DRV_SX1509_ONOFFCFGX_OFFINTENSITY_Msk (0x7 << DRV_SX1509_ONOFFCFGX_OFFINTENSITY_Pos) /*!< The mask of the field. */


/* Register: RISEFALLCFGX. */
/* Description: Fade configuration register for I/O[n]. */


/* Field RESERVED1: Unused field. */
#define DRV_SX1509_RISEFALLCFGX_RESERVED1_Pos (13)                                           /*!< The position of the field. */
#define DRV_SX1509_RISEFALLCFGX_RESERVED1_Msk (0x7 << DRV_SX1509_RISEFALLCFGX_RESERVED1_Pos) /*!< The mask of the field. */


/* Field FADEIN: Fade In setting of IO[n], (1 - 15 : TRiseN = (RegIOnN-(4x<OffIntensity>)) * <FadeIn> * (255/ClkN) 16 - 31 : TRiseN = 16 * (<OnTime>-(4x<OffIntensity>)) * <FadeIn> * (255/ClkN)). */
#define DRV_SX1509_RISEFALLCFGX_FADEIN_Pos (8)                                          /*!< The position of the field. */
#define DRV_SX1509_RISEFALLCFGX_FADEIN_Msk (0x1F << DRV_SX1509_RISEFALLCFGX_FADEIN_Pos) /*!< The mask of the field. */
#define DRV_SX1509_RISEFALLCFGX_FADEIN_Off (0)                                          /*!< No fade in configured. */


/* Field RESERVED0: Unused field. */
#define DRV_SX1509_RISEFALLCFGX_RESERVED0_Pos (5)                                            /*!< The position of the field. */
#define DRV_SX1509_RISEFALLCFGX_RESERVED0_Msk (0x7 << DRV_SX1509_RISEFALLCFGX_RESERVED0_Pos) /*!< The mask of the field. */


/* Field FADEOUT: Fade Out setting of IO[n], (1 - 15 : TFallN = (RegIOnN-(4x<OffIntensity>)) * <FadeOut> * (255/ClkN) 16 - 31 : TFallN = 16 * (<OnTime>-(4x<OffIntensity>)) * <FadeOut> * (255/ClkN)). */
#define DRV_SX1509_RISEFALLCFGX_FADEOUT_Pos (0)                                           /*!< The position of the field. */
#define DRV_SX1509_RISEFALLCFGX_FADEOUT_Msk (0x1F << DRV_SX1509_RISEFALLCFGX_FADEOUT_Pos) /*!< The mask of the field. */
#define DRV_SX1509_RISEFALLCFGX_FADEOUT_Off (0)                                           /*!< No fade out configured. */


/* Register: HIGHINPMODE. */
/* Description: High input enable register. */


/* Field PIN15: Enables high input mode for each (input-configured) IO. */
#define DRV_SX1509_HIGHINPMODE_PIN15_Pos      (15)                                      /*!< The position of the field. */
#define DRV_SX1509_HIGHINPMODE_PIN15_Msk      (0x1 << DRV_SX1509_HIGHINPMODE_PIN15_Pos) /*!< The mask of the field. */
#define DRV_SX1509_HIGHINPMODE_PIN15_Disabled (0)                                       /*!< VIH max = 3.6V and VCCx min = 1.2V. */
#define DRV_SX1509_HIGHINPMODE_PIN15_Enabled  (1)                                       /*!< VIH max = 5.5V and VCCx min = 1.65V. */


/* Field PIN14: Enables high input mode for each (input-configured) IO. */
#define DRV_SX1509_HIGHINPMODE_PIN14_Pos      (14)                                      /*!< The position of the field. */
#define DRV_SX1509_HIGHINPMODE_PIN14_Msk      (0x1 << DRV_SX1509_HIGHINPMODE_PIN14_Pos) /*!< The mask of the field. */
#define DRV_SX1509_HIGHINPMODE_PIN14_Disabled (0)                                       /*!< VIH max = 3.6V and VCCx min = 1.2V. */
#define DRV_SX1509_HIGHINPMODE_PIN14_Enabled  (1)                                       /*!< VIH max = 5.5V and VCCx min = 1.65V. */


/* Field PIN13: Enables high input mode for each (input-configured) IO. */
#define DRV_SX1509_HIGHINPMODE_PIN13_Pos      (13)                                      /*!< The position of the field. */
#define DRV_SX1509_HIGHINPMODE_PIN13_Msk      (0x1 << DRV_SX1509_HIGHINPMODE_PIN13_Pos) /*!< The mask of the field. */
#define DRV_SX1509_HIGHINPMODE_PIN13_Disabled (0)                                       /*!< VIH max = 3.6V and VCCx min = 1.2V. */
#define DRV_SX1509_HIGHINPMODE_PIN13_Enabled  (1)                                       /*!< VIH max = 5.5V and VCCx min = 1.65V. */


/* Field PIN12: Enables high input mode for each (input-configured) IO. */
#define DRV_SX1509_HIGHINPMODE_PIN12_Pos      (12)                                      /*!< The position of the field. */
#define DRV_SX1509_HIGHINPMODE_PIN12_Msk      (0x1 << DRV_SX1509_HIGHINPMODE_PIN12_Pos) /*!< The mask of the field. */
#define DRV_SX1509_HIGHINPMODE_PIN12_Disabled (0)                                       /*!< VIH max = 3.6V and VCCx min = 1.2V. */
#define DRV_SX1509_HIGHINPMODE_PIN12_Enabled  (1)                                       /*!< VIH max = 5.5V and VCCx min = 1.65V. */


