NordicPlayground/nrf528xx-ble-throughput-demo/display_shield_files/inc/drv_sx1509_bitfields.h
/* Field PIN11: Enables high input mode for each (input-configured) IO. */
#define DRV_SX1509_HIGHINPMODE_PIN11_Pos      (11)                                      /*!< The position of the field. */
#define DRV_SX1509_HIGHINPMODE_PIN11_Msk      (0x1 << DRV_SX1509_HIGHINPMODE_PIN11_Pos) /*!< The mask of the field. */
#define DRV_SX1509_HIGHINPMODE_PIN11_Disabled (0)                                       /*!< VIH max = 3.6V and VCCx min = 1.2V. */
#define DRV_SX1509_HIGHINPMODE_PIN11_Enabled  (1)                                       /*!< VIH max = 5.5V and VCCx min = 1.65V. */


/* Field PIN10: Enables high input mode for each (input-configured) IO. */
#define DRV_SX1509_HIGHINPMODE_PIN10_Pos      (10)                                      /*!< The position of the field. */
#define DRV_SX1509_HIGHINPMODE_PIN10_Msk      (0x1 << DRV_SX1509_HIGHINPMODE_PIN10_Pos) /*!< The mask of the field. */
#define DRV_SX1509_HIGHINPMODE_PIN10_Disabled (0)                                       /*!< VIH max = 3.6V and VCCx min = 1.2V. */
#define DRV_SX1509_HIGHINPMODE_PIN10_Enabled  (1)                                       /*!< VIH max = 5.5V and VCCx min = 1.65V. */


/* Field PIN9: Enables high input mode for each (input-configured) IO. */
#define DRV_SX1509_HIGHINPMODE_PIN9_Pos      (9)                                      /*!< The position of the field. */
#define DRV_SX1509_HIGHINPMODE_PIN9_Msk      (0x1 << DRV_SX1509_HIGHINPMODE_PIN9_Pos) /*!< The mask of the field. */
#define DRV_SX1509_HIGHINPMODE_PIN9_Disabled (0)                                      /*!< VIH max = 3.6V and VCCx min = 1.2V. */
#define DRV_SX1509_HIGHINPMODE_PIN9_Enabled  (1)                                      /*!< VIH max = 5.5V and VCCx min = 1.65V. */


/* Field PIN8: Enables high input mode for each (input-configured) IO. */
#define DRV_SX1509_HIGHINPMODE_PIN8_Pos      (8)                                      /*!< The position of the field. */
#define DRV_SX1509_HIGHINPMODE_PIN8_Msk      (0x1 << DRV_SX1509_HIGHINPMODE_PIN8_Pos) /*!< The mask of the field. */
#define DRV_SX1509_HIGHINPMODE_PIN8_Disabled (0)                                      /*!< VIH max = 3.6V and VCCx min = 1.2V. */
#define DRV_SX1509_HIGHINPMODE_PIN8_Enabled  (1)                                      /*!< VIH max = 5.5V and VCCx min = 1.65V. */


/* Field PIN7: Enables high input mode for each (input-configured) IO. */
#define DRV_SX1509_HIGHINPMODE_PIN7_Pos      (7)                                      /*!< The position of the field. */
#define DRV_SX1509_HIGHINPMODE_PIN7_Msk      (0x1 << DRV_SX1509_HIGHINPMODE_PIN7_Pos) /*!< The mask of the field. */
#define DRV_SX1509_HIGHINPMODE_PIN7_Disabled (0)                                      /*!< VIH max = 3.6V and VCCx min = 1.2V. */
#define DRV_SX1509_HIGHINPMODE_PIN7_Enabled  (1)                                      /*!< VIH max = 5.5V and VCCx min = 1.65V. */


/* Field PIN6: Enables high input mode for each (input-configured) IO. */
#define DRV_SX1509_HIGHINPMODE_PIN6_Pos      (6)                                      /*!< The position of the field. */
#define DRV_SX1509_HIGHINPMODE_PIN6_Msk      (0x1 << DRV_SX1509_HIGHINPMODE_PIN6_Pos) /*!< The mask of the field. */
#define DRV_SX1509_HIGHINPMODE_PIN6_Disabled (0)                                      /*!< VIH max = 3.6V and VCCx min = 1.2V. */
#define DRV_SX1509_HIGHINPMODE_PIN6_Enabled  (1)                                      /*!< VIH max = 5.5V and VCCx min = 1.65V. */


/* Field PIN5: Enables high input mode for each (input-configured) IO. */
#define DRV_SX1509_HIGHINPMODE_PIN5_Pos      (5)                                      /*!< The position of the field. */
#define DRV_SX1509_HIGHINPMODE_PIN5_Msk      (0x1 << DRV_SX1509_HIGHINPMODE_PIN5_Pos) /*!< The mask of the field. */
#define DRV_SX1509_HIGHINPMODE_PIN5_Disabled (0)                                      /*!< VIH max = 3.6V and VCCx min = 1.2V. */
#define DRV_SX1509_HIGHINPMODE_PIN5_Enabled  (1)                                      /*!< VIH max = 5.5V and VCCx min = 1.65V. */


/* Field PIN4: Enables high input mode for each (input-configured) IO. */
#define DRV_SX1509_HIGHINPMODE_PIN4_Pos      (4)                                      /*!< The position of the field. */
#define DRV_SX1509_HIGHINPMODE_PIN4_Msk      (0x1 << DRV_SX1509_HIGHINPMODE_PIN4_Pos) /*!< The mask of the field. */
#define DRV_SX1509_HIGHINPMODE_PIN4_Disabled (0)                                      /*!< VIH max = 3.6V and VCCx min = 1.2V. */
#define DRV_SX1509_HIGHINPMODE_PIN4_Enabled  (1)                                      /*!< VIH max = 5.5V and VCCx min = 1.65V. */


/* Field PIN3: Enables high input mode for each (input-configured) IO. */
#define DRV_SX1509_HIGHINPMODE_PIN3_Pos      (3)                                      /*!< The position of the field. */
#define DRV_SX1509_HIGHINPMODE_PIN3_Msk      (0x1 << DRV_SX1509_HIGHINPMODE_PIN3_Pos) /*!< The mask of the field. */
#define DRV_SX1509_HIGHINPMODE_PIN3_Disabled (0)                                      /*!< VIH max = 3.6V and VCCx min = 1.2V. */
#define DRV_SX1509_HIGHINPMODE_PIN3_Enabled  (1)                                      /*!< VIH max = 5.5V and VCCx min = 1.65V. */


/* Field PIN2: Enables high input mode for each (input-configured) IO. */
#define DRV_SX1509_HIGHINPMODE_PIN2_Pos      (2)                                      /*!< The position of the field. */
#define DRV_SX1509_HIGHINPMODE_PIN2_Msk      (0x1 << DRV_SX1509_HIGHINPMODE_PIN2_Pos) /*!< The mask of the field. */
#define DRV_SX1509_HIGHINPMODE_PIN2_Disabled (0)                                      /*!< VIH max = 3.6V and VCCx min = 1.2V. */
#define DRV_SX1509_HIGHINPMODE_PIN2_Enabled  (1)                                      /*!< VIH max = 5.5V and VCCx min = 1.65V. */


/* Field PIN1: Enables high input mode for each (input-configured) IO. */
#define DRV_SX1509_HIGHINPMODE_PIN1_Pos      (1)                                      /*!< The position of the field. */
#define DRV_SX1509_HIGHINPMODE_PIN1_Msk      (0x1 << DRV_SX1509_HIGHINPMODE_PIN1_Pos) /*!< The mask of the field. */
#define DRV_SX1509_HIGHINPMODE_PIN1_Disabled (0)                                      /*!< VIH max = 3.6V and VCCx min = 1.2V. */
#define DRV_SX1509_HIGHINPMODE_PIN1_Enabled  (1)                                      /*!< VIH max = 5.5V and VCCx min = 1.65V. */


/* Field PIN0: Enables high input mode for each (input-configured) IO. */
#define DRV_SX1509_HIGHINPMODE_PIN0_Pos      (0)                                      /*!< The position of the field. */
#define DRV_SX1509_HIGHINPMODE_PIN0_Msk      (0x1 << DRV_SX1509_HIGHINPMODE_PIN0_Pos) /*!< The mask of the field. */
#define DRV_SX1509_HIGHINPMODE_PIN0_Disabled (0)                                      /*!< VIH max = 3.6V and VCCx min = 1.2V. */
#define DRV_SX1509_HIGHINPMODE_PIN0_Enabled  (1)                                      /*!< VIH max = 5.5V and VCCx min = 1.65V. */


/* Register: RESET. */
/* Description: Software reset register. */


/* Field CODE: Reset code. */
#define DRV_SX1509_RESET_CODE_Pos   (0)                                   /*!< The position of the field. */
#define DRV_SX1509_RESET_CODE_Msk   (0xFFFF << DRV_SX1509_RESET_CODE_Pos) /*!< The mask of the field. */
#define DRV_SX1509_RESET_CODE_Reset (0x1234)                              /*!< Code for reset of the device (same as POR). */

#endif // DRV_SX1509_BITFIELDS_H__
